{"Akron": {"Harvey S. Firestone Memorial": "The Harvey S. Firestone Memorial is a large sculpture ensemble dedicated to Harvey Firestone, created by sculptors James Earle Fraser and Donald De Lue in Akron, Ohio. The monument was designed by architect Eric Gugler and was dedicated on August 3, 1950. It is located at Bridgestone Firestone Inc., 10 E Firestone Blvd, Akron, OH 44301, adjacent to the Research Building.\nThe impetus to create a monument to Harvey Firestone in Akron began shortly after his death in 1938; however, the advent of World War Two temporarily delayed the project, although discussions regarding the site continued in 1944 between representatives of the Firestone company and the architect Gugler. It was during these discussions that the patron expressed the desire that the work include more than just a statue of Firestone. Gigler then developed the concept of the allegorical bas relief panels on a curved exedra.\nAs work on the piece progressed, the elderly Fraser found doing the physically demanding work on the monumental seated figure to be more and more taxing and was aided in this process by both his wife, sculptor Laura Gardin Fraser, who represented him at the statue's dedication, and by De Lue.\n\nHowever, as the dedication, timed to mark the Firestone Tire and Rubber Company's 50th anniversary, drew near, it was realized that the bronze work was not going to be finished; Fraser therefore suggested that a painted plaster version of the statue be used. Unknown to the general public, this is what was viewed at the unveiling by Firestone's five sons. The two statues were quietly switched later.\nDe Lue's involvement in the project came about when Gugler recommended using Paul Manship, with whom he had frequently worked, to do the panels in the exedra. Fraser, \"who felt himself to be in direct competition with Manship\", countered by auggesting De Lue, with whom Gugler had also worked, and he was awarded the commission. For the back of the exedra De Lue produced six allegorical relief panels, Contemplation, Invention (or Inspiration), The Hours, The Years, Leadership, and Fruition (or Achievement).\n\nAlthough the statue is a major work, it is one of Fraser's more obscure and misunderstood ones. The bust of Firestone that he created at the same time and currently housed in the National Portrait Gallery is mentioned in two of the standard references on the artist, The End of the Trail by Krakell and the Syracuse University exhibition catalog, but neither one mentions the monument. On the other hand, Freundlich's The Sculpture of James Earle Fraser does discuss the memorial but attributes De Lue's relief panels, which the author erroneously places \"on the base,\" to Fraser .\nAt some point in their history, prior to 2013, De Lue's reliefs were fairly seriously vandalized. Inspection reveals that noses, fingers and toes, the major elements that had been undercut in the work's carving process, had been beaten off the granite figures."}}