{"Akron": {"Portage Path Elementary School": "Portage Path Elementary School is a primary school in Akron, Ohio, United States in the Akron Public School District. Pupils range from kindergarten to 5th grade. Its classroom teacher average is 27.3, is average enrollment is 380, and its student-to-teacher ratio is 12.527:1, all three of which are below both the district average and the state average. 91% of the pupils at the school are African American, the next largest ethnic group being Caucasian American pupils, which comprise 7% of the total.\n65.4% of the school's spending (USD4,114) is on instruction, and 18.2% (USD1,144) on building operation. The remaining money is spent on administration (4.1%), pupil support (9.4%), and staff support (2.9%).\nPortage Path is part of the C5 (\"Children Connecting Classroom, Community, and Curriculum\") programme. In the 1980s it was one of the first schools in the area to receive classroom computers from Apple Computer. The goal of the C5 programme is to extend pupils time with computers by enouraging pupils' families to be connected both to Internet and to the school. The C5 programme provides USD500 for families towards the cost of one of several types of personal computer, and Time Warner Cable provides free Road Runner Internet access. As of 2001, half of all pupils were connected to Internet at home via the C5 programme. Pupils use their home computers for homework, and a web site to set up portfolios and to communicate with their teachers from home and with their families from school. School lessons also heavily employ computers, with, for example, pupils being instructed in mathematics, geography, and problem solving by daily consultation of weather reports on Intellicast, and learning about Groundhog Day by looking at on-line maps of Punxsutawney, Pennsylvania and visiting the web sites of its shops.\nAnother program offered by the school is ROAD (\"Reach Out and Dance\"), which is intended to help pupils with stress of school and family life, and with anger management problems. It is run by the Cuyahoga Valley Youth Ballet, which teaches dance classes to pupils on Friday afternoons, structuring the classes very much like ballet classes.\nThe original school building was built in 1908. Plans to demolish and rebuild the school, as part of the USD800million Akron City School District construction project, were met with mixed emotions. Some neighborhood residents wanted to see the school either be renovated rather than demolished, or moved to another site; while parents of students wanted a new school as soon as possible. Portage Path students will be moving to a temporary facility in January 2009 while their school is demolished and rebuilt- keeping as many historical artificts as possible.\nThe new building, known as the Portage Path Community Learning Center, was dedicated on August 30, 2010."}}