{"Akron": {"East Market Street Church of Christ": "The East Market Street Church of Christ is a historic former church building in Akron, Ohio, United States. Built in 1912 and one of the oldest Akron Plan churches in existence, it has been designated a historic site.\nThe Akron architectural firm of Harpster and Bliss, foremost in their field in the early twentieth century, designed the church building in an early form of the Akron Plan. Developed by inventor Lewis Miller, the distinctive floor plan consists of a central sanctuary surrounded by Sunday school rooms. The city's earliest (and thus earliest in the world) Akron Plan churches have not survived, leaving the 1912 East Market Street church as the oldest such church in the city; into the late twentieth century, it was the city's oldest Akron Plan church still in use as a church.\nEast Market Street is a two-story brick building with walls laid in Flemish bond. The Neoclassical structure rests on a stone foundation and is covered with an asphalt roof, and terracotta is used for some detailing. Its facade comprises a pedimented two-column central portico, with stairs providing access from the sidewalk to the recessed central entrance. The corners of the facade are ordinary walls, comparable to those on the side, with rectangular windows on the first story and arched windows on the second. A basement faces the parking lot on the northwestern side, with an at-grade entrance near the front of the building.\nIn 1988, the East Market Street Church of Christ was listed on the National Register of Historic Places, qualifying because of its historically significant architecture. Critical to this designation was its relatively little changed interior; aside from being the oldest unmodified Akron Plan church in the city, it was one of just two surviving anywhere citywide. At the time, it was still home to the church that had built it, although the congregation has since merged with another Disciples church; the combined congregation worships on Akron's Darrow Road, and the building at 864 Market Street has become home to the Summit Academy Secondary School, an alternative school. It occasionally remains in use for non-academic purposes, hosting events such as the November 2014 funeral of a police officer shot a few blocks away."}}