{"Akron": {"Portage Lakes": "The Portage Lakes are a group of glacial kettle lakes and reservoirs in Northeast Ohio. The name comes from an old Indian portage path that connected the Cuyahoga River flowing north to Lake Erie and the Tuscarawas River, a tributary of the Muskingum River, which flows south to the Ohio River. This proved advantageous for the Indians and early settlers as navigation from Lake Erie to the Ohio was possible with only an eight-mile portage. Portage Lakes State Park lies at one of the highest points of the state and on a major watershed divide in Ohio. Some water from the lakes reaches Lake Erie and some flows to the Ohio River.\nThere is an unincorporated community named Portage Lakes in Summit County, near 41°00′26″N 081°31′37″W Elevation: 1,053 feet (321 m), in the area.\nThe area became an important trading post for settlers and Indians. It was a recognized landmark during the War of 1812, serving as a rendezvous point of American troops. The old Indian portage path was part of the ancient boundary between the Six Nations and the Western Indians.\nThe city of Akron was laid out in 1825 and was first settled by Irish laborers and others working on the Ohio and Erie Canal. Once the canal was completed, the town flourished. Several important industries brought prosperity to the area including stoneware potteries, sewer pipe manufacturing, the match industry and, most recently, the tire and rubber industry. At one time, the Blue Diamond Match Company in Akron used three million board feet (7,000 m³) of white pine lumber per year for the manufacture of its matches.\nSeveral of the Portage Lakes were built as feeder reservoirs for the canals to maintain the required depth of 4 feet (1.2 m). The lakes were used for this purpose until the canals were abandoned in 1913. The lakes were then used to meet the water needs of the local industries. Some portions of the remnant canals in the Akron area can still be boated.\nThe Ohio Department of Public Works maintained the canal lands for recreational purposes until 1949 when the Portage Lakes were transferred to the newly formed Ohio Department of Natural Resources, Division of Parks and Recreation."}}