{"Akron": {"Rolling Acres, Akron, Ohio": "Rolling Acres is a shopping district in Akron, Ohio, surrounding the demolished Rolling Acres Mall. Planning for the area began in 1960s with Forest City Enterprises, a Cleveland real estate company and the powerful Buchholzer family, whose previous endeavors involved financing much of the Chapel Hill Mall area. Despite warnings by civic leaders and former Mayor Edward O. Erickson that the addition of a third mall in the Akron area would harm downtown department stores, the Rolling Acres area was born with Rolling Acres Mall serving as its anchor. Pulling from a diverse population of blue collar workers in Barberton, Ohio and Kenmore, and inner city neighborhoods such as West Akron and Lane-Wooster, the Rolling Acres shopping district blossomed. At its peak it was the most visited mall in Northeast Ohio. Today, Rolling Acres stands as a skeleton of what it once was, mirroring many other parts of the Midwest that have suffered from stagnant economic conditions, saturated markets, and unprofitable foot traffic.\nThe shopping district is located in the City of Akron proper, and encompasses most of the area. It had a number of large big box retailers including:\nHandy Andy Home Improvement Center (formerly Forest City) – closed 1996\nAmes (formerly Hills & Gold Circle) - defunct\nApples Grocery Store- Closed 2000\nPet Supplies Plus – site closed\nFretter – defunct 1996\nToys \"R\" Us – closed 2006\nKids \"R\" Us – site closed\nOfficemax – closed 2003\nCoconuts Music & Moves – site closed\nMarc's (former Children's Palace) – Closed 2004\nSeveral of the buildings have been condemned, while other are taking transient uses such as fronts for flea markets, and mattress liquidators. The Target closed in February 2005, with a new store being opened in the western suburb of Wadsworth, Ohio. Toys R’ Us closed as part of a larger consolidation plan by its new owners. The city of Akron no longer views the area as viable for retail. As Rolling Acres got smaller, the nearby Montrose area got larger, and now has many of its former anchors."}}