{"Akron": {"Akron, Ohio": "Akron () is the fifth-largest city in the U.S. state of Ohio and is the county seat of Summit County. It is located on the western edge of the Glaciated Allegheny Plateau, approximately 39 miles (63 km) south of Lake Erie.\nAs of the 2015 Census Estimate, the city proper had a total population of 197,542, making it the 119th largest city in the United States. The Akron, OH Metropolitan Statistical Area (MSA) covers Summit and Portage counties, and in 2010 had a population of 703,200. It is also part of the larger Cleveland-Akron-Canton, OH Combined Statistical Area, which in 2013 had a population of 3,501,538, ranking 15th.\nCo-founded along the Little Cuyahoga River in 1825 by Simon Perkins and Paul Williams, it was chosen as a strategic point at the summit of the developing Ohio and Erie Canal. The name derived from the Greek word \"ἄκρον\" signifying a summit or high point. Due to Eliakim Crosby founding \"North Akron\" (Cascade) in 1833, \"South\" was added to its name until the two merged into an incorporated village in 1836. Neighboring settlements Kenmore and Ellet became annexed in 1929. Residents of the city are called \"Akronites\". It has had many nicknames, three of which are \"Rubber Capital of the World\", \"Rubber City\" and \"City of Invention\".\nAkron became a manufacturing center owing to its location on the canal, as well as being connected to numerous others and railroad lines. With Goodyear, Gojo Industries, FirstEnergy, Huntington Bank (formerly known as FirstMerit Corporation), and Charter Spectrum among its employers, its economy has diversified sectors that include manufacturing, education, healthcare, and biomedical.\nThe city is home to the All-American Soapbox Derby, WGC-Bridgestone Invitational, Stan Hywet Hall and Gardens, Akron City Hospital (known for LeBron James and Stephen Curry), the Goodyear Polymer Center, and Alcoholics Anonymous (AA). It is also the former home of Goodrich, Firestone, General Tire, the National Inventors Hall of Fame, National Marble Tournament, Professional Bowlers Association, Women's Professional Mud Wrestling, and first National Football League Champions the Akron Pros.\nNotable historical events that occurred in the city include the Akron School Law of 1847 creating the K-12 system, and Sojourner Truth giving her Ain't I A Woman? speech in 1851. Resident Ferdinand Schumacher supplied the Union Army with quaker oats during the American Civil War. The popularization of the church architectural Akron Plan, the goiter prevention iodized salt Akron Experiment, City of Akron v. Akron Center for Reproductive Health, and portions of the 2014 Gay Games also occurred. Akron is known for the rubber, tire, and airship industries among others, including the trucking, stoneware, sewer pipe, fishing tackle, farming equipment, mining, match, zipper, and toy industries. With a population increase of 201.8% during the 1910s, it became the country's fastest-growing city. Three major civil unrest events took place during the riot of 1900, rubber strike of 1936, and the Wooster Avenue riots of 1968. Dr. W.E.B. Du Bois (1920) and President Bill Clinton (1997) gave speeches on race relations in the city. While visiting during August 1914, Marcus Garvey founded the Universal Negro Improvement Association (UNIA). In 1971, James R. Williams founded Alpha Phi Alpha Homes Inc. to build the Channelwood Village area of Akron. In 2008, 91-year-old resident Addie Polk became the poster child of the financial crisis of 2007–2010 after shooting herself moments before law enforcement were going to remove her from the foreclosed house. During a 2016 march on West Market Street, purple heart Vietnam War veteran Kenn Gilchrist set himself on fire in protest of Donald Trump's presidential election victory.\nNotable criminal history includes mobster Rosario Borgio headquartering the area's black hand operations, and Pretty Boy Floyd's Walker-Mitchell mob's activities. Though Akron was part of the Underground Railroad while active, the city was also part of the country's largest local chapter of the Ku Klux Klan having many city officials as members which Wendell Willkie successfully opposed before becoming the 1940 Republican nominee for President. It also saw abolitionist John Brown as a resident with his house now as a landmark. The county has been nicknamed the \"Meth Capital of Ohio\", ranking third in the nation for number of registered meth sites, mainly due to Akron."}}