{"Baton_Rouge": {"Louisiana Governor's Mansion": "The Louisiana Governor's Mansion is the official residence of the Governor of Louisiana and his or her family. The Governor’s Mansion was built in 1963 when Jimmie Davis was Governor of Louisiana. The Mansion overlooks Capital Lake near the Louisiana State Capitol in Baton Rouge.\n\nThe Mansion was designed by the architectural firm of Annan and Gilmer of Shreveport, Louisiana. The final construction cost for the building was $893,843.00. The inspiration for the exterior design was Oak Alley Plantation in Vacherie, Louisiana. Like many plantation homes built between 1830 and 1860, Oak Alley was designed with a second story veranda.\nThe second-floor veranda found at Oak Alley was omitted. It was thought that the concept of a second story veranda was too informal for a Governor’s Mansion. Although the new Mansion is in the Greek Revival style, it also incorporates several Georgian features such as dormers, a fanlight of the doorway at the front entrance, and the long window on the circular stairs in the rotunda.\nInside, the floor plan includes twelve bedrooms and eighteen baths, two kitchens and one kitchenette, two dining rooms, one breakfast room, a receiving room for state affairs and another for routine business, a living room, a sitting room, two butleries and two security stations for the state troopers assigned to the mansion, and two offices-one for the governor and one for a secretary. Along with the dramatic spiral stairway in the rotunda, there is an elevator running from the basement to the third floor, as well as a system of dumbwaiters. These are wise amenities, considering the size of the house: altogether, the mansion comprises some twenty-five thousand square feet, serviced by a ninety ton cooling system to battle Louisiana's oppressive summer weather. The main foyer at the mansion features a mural that depicts various aspects of Louisiana History as well as symbolic references to many past Louisiana Governors. This mural was originally painted in the year 2000 under the administration of Governor Mike Foster. It was most recently updated with symbolic references relating to Hurricane Katrina and then Governor Kathleen Blanco.\n\nWhite Doric columns line the building on three sides. The columns are interrupted on the east side by a driveway leading to an underground garage. The exterior of the building is constructed of hand-molded brick that has been painted white. The roof is made of cleft- face Vermont non-fading, gray-green slate. Front and side porches are of the same type of slate. Lamp posts located in the parking lot east of the building were once gas lights used in Plymouth, England. The cast iron railing atop the driveway retaining walls and at the second story windows was designed from the railing used on the old Beauregard House on Chartres Street in New Orleans and was modified with the diamond pattern by the architect.\nThe mansion sits on an 8-acre (32,000 m2) parcel of land. The grounds include a tennis court, a swimming pool, a vegetable garden, and a fountain area.\nThe Governor's Mansion is located at 1001 Capitol Access Road (LA-3045) in Baton Rouge, Louisiana 70802. The mansion is open to the public for tours by appointment only."}}