{"Baton_Rouge": {"Beauregard Town": "Beauregard Town, also known as Beauregard Town Historic District, is a historic district in downtown Baton Rouge, Louisiana, anchored by Government Street. The historic district was listed on the National Register of Historic Places in 1980. Its boundaries were increased twice in 1983, and once more in 1999.\nBeauregard Town was commissioned in 1806 by Elias Beauregard. It is the second-oldest neighborhood in Baton Rouge (after Spanish Town) and is listed on the National Register of Historic Places.\nBeauregard Town is the area bounded by North Blvd., South Blvd, East Blvd., and on the west by St. Louis Street. Government Street (or the \"Grand Rue\" as Beauregard wanted it) runs through the middle of Beauregard Town, with four streets — Beauregard, Grandpre, Penalvert, and Somerulos — approaching it on diagonal angles in the form of an \"X,\" typical of the European manner of town design at the time.\nThose streets are named for Beauregard himself, for Don Carlos Louis Boucher de Grand Pré (the Spanish administrator in 1806), for Roman Catholic Bishop Luis de Penalver (the bishop in 1806), and for the Marquis de Someruelos, Captain-General of Cuba. Beauregard named other streets after rulers: Philip, Louis, Ferdinand, Charles, Napoleon, and Maximilian (several of these namesakes became saints through later translation error). Other streets Beauregard named after countries and continents: Spain, France, America, and Europe.\nHistoric homes in Beauregard Town include the Governor Henry L. Fuqua House (circa 1834) and the Williams House (circa 1890), both on Napoleon Street, as well as the Judge Robert D. Beale House (circa 1840) on the corner of St. Louis and Government streets. It includes the Old Louisiana Governor's Mansion, separately listed on the National Register.\nThe first 1983 increase added the privately owned Levy Hay Warehouse, built in 1920, on Front St. The second 1983 increase added the state-owned Armour Building, built in 1929, on Mayflower St.\nThe 2000 increase added state-owned houses of Bungalow/Craftsman and Queen Anne architecture. Today, many of the homes have been renovated and are used as law offices."}}