{"Baton_Rouge": {"Pete Maravich Assembly Center": "The Pete Maravich Assembly Center is a 13,215-seat multi-purpose arena in Baton Rouge, Louisiana. The arena opened in 1972. It is home to the Louisiana State University Tigers and Lady Tigers basketball teams, the LSU Tigers women's gymnastics team and the LSU Tigers women's volleyball team. It was originally known as the LSU Assembly Center, but was renamed in honor of Pete Maravich, a Tiger basketball legend, shortly after his death in 1988. Louisiana Governor Buddy Roemer signed an act to rename the building in Maravich's honor (under Louisiana law, no LSU or state owned building may be named after a living person). Maravich never played in the arena as a collegian but played in it as a member of the Atlanta Hawks in a preseason game. But his exploits while at LSU led the University to build a larger home for the basketball team, which languished for decades in the shadow of the school's football program. The Maravich Center is known to locals as \"The PMAC\" or \"Pete's Palace\", or by its more nationally known nickname, \"The Deaf Dome\", coined by Dick Vitale. The Maravich Center's neighbor, Tiger Stadium is known as \"Death Valley\".\nThe slightly oval building is located directly to the north of Tiger Stadium, and its bright-white roof can be seen in many telecasts of that stadium. The arena concourse is divided into four quadrants: Pete Maravich Pass, The Walk of Champions, Heroes Hall and Midway of Memories. The quadrants highlight former LSU Tiger athletes, individual and team awards and memorabilia pertaining to the history of LSU basketball, gymnastics and volleyball. There are 11,230 permanent seats in the arena. 6,931 upper level seats, 4,299 lower level seats and 2,000 seats on retractable risers.\nThe “L” Club meeting room and Tiger Athletic Foundation offices are also located in the arena.\nPrior to building the Assembly Center, LSU played its games at John M. Parker Agricultural Coliseum (aka, the \"Cow Palace\"), located on the southeast corner of the campus."}}