{"Boston": {"First Town-House, Boston": "The First Town-House in Boston, Massachusetts Bay Colony was located on the site of the Old State House and served as Boston's first purpose-built town hall and colonial government seat.\nRobert Keayne left ₤300 in his will for the construction of a marketplace and town-house; this was more than doubled by subscriptions from 104 \"Townesmen\", and on August 1, 1657, a contract was signed with Messrs. Thomas Joy and Bartholomew Bernad for the construction. The initial price was ₤400 but the final bill came out to ₤680. It was to be\n\nThe wood frame building was completed and occupied in 1658 and destroyed in the great fire on the night of October 2–3, 1711, though a sketch was drawn in 1930 based on the original specifications. This shows an open-walled public market (a traditional medieval form) on the ground floor. Three rows of seven stout posts supported the upper stories, which were walled by broad planks three inches (76 mm) thick, \"well grooved into one another\" and planed smooth on both sides. The roof was of the meeting-house type: hipped, with a \"walke upon the top fourteen or 15 foote wide with two turrets, & turned Balasters and railes, round about the walke\". The second story was ten feet high, and the third half-story rooms were lighted by three cross gables on each side. The three-foot overhang \"everie way\", a very rare feature in non-military architecture, was braced by diagonal struts from the posts and ornamented by corner pendants. A steep stairway, hitched to one end of the building like an inelegant afterthought, clambered to the upper rooms. These consisted of Boston's first public library, a gift of Robert Keayne; a large room \"for the courts to meete in both in Winter & Sumer, & so for the Townsmen & commissioners of the Towne\"; a room for an Armory (Keayne had organized the Ancient and Honorable Artillery Company of Massachusetts and become its first commander); and \"a gallery or some other handsome roome for the Elders to meete in\".\nThe building also housed the Colonial government, with Governors Endecott, Bellingham, Leverett and Bradstreet presiding under the old charter, then Edmund Andros, followed by Phips, Stoughton, Bellomont and Dudley under the new charter. It was the focal point of Boston’s civil and political life: receptions held by governors and prominent citizens; assemblies of the Legislature; meetings of the colony and town officers; the marketplace with its stalls and stores all made it so. In his diary, Samuel Sewall recorded many stirring scenes inside and near the town-house. There the revolt against Governor Andros was centered; the same year the first Episcopalian service in Boston was held in the deputies' room. Captain Kidd was there examined by the governor in 1699; the captain of the Ancient and Honorable Artillery Company was elected in the large room in 1701, and the Company exercised there in June 1702. In 1704 Captain Quelch and five other pirates were tried there."}}