{"Boston": {"Publicity Building": "Publicity (from French publicité, from public ‘public’) is the movement of information to the general public from the media. The subjects of publicity includes people (for example, politicians and performing artists), goods and services, organizations, and works of art or entertainment.\nPublicity is gaining public visibility or awareness for a product, service or your company via the media. It is the publicist that carries out publicity, while PR is the strategic management function that helps an organization communicate, establishing and maintaining communication with the public. This can be done internally, without the use of media.\nFrom a marketing perspective, publicity is one component of promotion and marketing. The other elements of the promotional mix are advertising, sales promotion, direct marketing and personal selling. Examples of promotional tactics include:\nAnnounce an appointment\nArrange a speech or talk\nArrange for a testimonial\nArt people\nConduct a poll or survey\nEvent sponsorship\nInvent then present an award\nIssue a commendation\nIssue a report\nMake an analysis or prediction\nOrganize a tour of your business or projects\nStage a debate\nTake a stand on a controversial subject\nThe advantages of publicity are low cost and credibility (particularly if the publicity is aired in between news stories like on evening TV news casts). New technologies such as weblogs, web cameras, web affiliates, and convergence (phone-camera posting of pictures and videos to websites) are changing the cost-structure. The disadvantages are lack of control over how your releases will be used, and frustration over the low percentage of releases that are taken up by the media.\nPublicity draws on several key themes including birth, love, and death. These are of particular interest because they are themes in human lives which feature heavily throughout life. In television series, several couples have emerged during crucial ratings and important publicity times as a way to make constant headlines. Also known as a publicity stunt, the pairings may or may not be according to the fact.\n\"Publicity is not merely an assembly of competing messages: it is a language in itself which is always being used to make the same general proposal,\" writes the art critic John Berger. \"It proposes to each of us that we transform ourselves, or our lives by buying. .publicity is not paid for something more.\"\nPublicity is often referred to as the result of public relations in terms of providing favourable information to media and any third party outlets; these may including bloggers, mainstream media, as well as new media forms such as podcasts. All this is done to provide a message to consumers without having to pay for direct time or space. This in return creates awareness and carries out more credibility as well. After the message has been distributed, the publicist in charge of the information will lose control on how the message is used and interpreted, much different to the way it works in advertising. According to Grunig, public relations is often reduced to publicity. He also states how publicity is a form of activity in which should be associated with the sales promotion effort of a company, in order to help aid advertising and personal salesmanship as well. Kent also stated that the doing of publicity can help attract attention whilst also supplying information regarding a specific organization or individual client and any event, activity or attribute associated with them.\nThe use of publicity is also known to be an important strategic element and promotional tool due to its effect of intentional exposure over a consumer, this helps publicity gain a beneficial advantage over other marketing aspects such as Advertising alongside its high credibility. Favourable publicity is also created through reputation management in which organizations try strive to control via the web. Furthermore, despite the fact that publicity, both good or bad, can be beneficial for an organization, company or client, much of it is paid for despite claims that publicity is often free. Despite publicity being an influential benefit within the marketing sector, one disadvantage which highly affects publicity, is the lack of ability in which publicity cannot be repeated as such compared to advertising."}}