{"Boston": {"Big Dig": "The Central Artery/Tunnel Project (CA/T), known unofficially as the Big Dig, was a megaproject in Boston that rerouted the Central Artery of Interstate 93, the chief highway through the heart of the city, into the 1.5-mile (2.4 km) Thomas P. O'Neill Jr. Tunnel. The project also included the construction of the Ted Williams Tunnel (extending Interstate 90 to Logan International Airport), the Leonard P. Zakim Bunker Hill Memorial Bridge over the Charles River, and the Rose Kennedy Greenway in the space vacated by the previous I-93 elevated roadway. Initially, the plan was also to include a rail connection between Boston's two major train terminals. Planning began in 1982; the construction work was carried out between 1991 and 2006; and the project concluded on December 31, 2007 when the partnership between the program manager and the Massachusetts Turnpike Authority ended.\nThe Big Dig was the most expensive highway project in the US, and was plagued by cost overruns, delays, leaks, design flaws, charges of poor execution and use of substandard materials, criminal arrests, and one death. The project was originally scheduled to be completed in 1998 at an estimated cost of $2.8 billion (in 1982 dollars, US$6.0 billion adjusted for inflation as of 2006). However, the project was completed in December 2007 at a cost of over $14.6 billion ($8.08 billion in 1982 dollars, meaning a cost overrun of about 190%) as of 2006. The Boston Globe estimated that the project will ultimately cost $22 billion, including interest, and that it would not be paid off until 2038. As a result of a death, leaks, and other design flaws, Bechtel and Parsons Brinckerhoff—the consortium that oversaw the project- agreed to pay $407 million in restitution and several smaller companies agreed to pay a combined sum of approximately $51 million.\nThe Rose Fitzgerald Kennedy Greenway is a roughly 1.5-mile-long (2.4 km) series of parks and public spaces, which are the final part of the Big Dig after Interstate 93 was put underground. The Greenway was named in honor of Kennedy family matriarch Rose Fitzgerald Kennedy, and was officially dedicated on July 26, 2004."}}