{"Boston": {"Greater Boston": "Greater Boston is the metropolitan region of New England encompassing the municipality of Boston, the capital of the U.S. state of Massachusetts, and the most populous city in New England, as well as its surrounding areas. The region forms the northern arc of the US northeast megalopolis and as such, Greater Boston can be described as either a metropolitan statistical area (MSA), or as a broader combined statistical area (CSA). The MSA consists of most of the eastern third of Massachusetts, excluding the South Coast region and Cape Cod; while the CSA additionally includes the municipalities of Manchester (the largest city in the U.S. state of New Hampshire), Providence (the capital and largest city of the U.S. state of Rhode Island), Worcester, Massachusetts (the second largest city in New England), as well as the South Coast region and Cape Cod in Massachusetts.\nSome of Greater Boston's most well-known contributions to human civilization involve the region's higher education and medical institutions. Greater Boston has been influential upon American history and industry. The region and the state of Massachusetts are global leaders in biotechnology, engineering, higher education, finance, and maritime trade.\nOver 80% of Massachusetts' population lives in the Greater Boston metropolitan region. Greater Boston is ranked tenth in population among US metropolitan statistical areas, home to 4,732,161 people as of the 2014 US Census estimate, and sixth among combined statistical areas, with a population of 8,099,575. The area has hosted many people and sites significant to American culture and history, particularly American literature, politics, and the American Revolution.\nPlymouth was the site of the first colony in New England, founded in 1620 by the Pilgrims, passengers of the Mayflower. In 1692, the town of Salem and surrounding areas experienced one of America's most infamous cases of mass hysteria, the Salem witch trials. In the late 18th century, Boston became known as the \"Cradle of Liberty\" for the agitation there that led to the American Revolution.\nThe Greater Boston region has played a powerful commercial and cultural role in the history of the United States. Before the American Civil War, the region was a center for the abolitionist, temperance, and transcendentalist movements. In 2004, Massachusetts became the first U.S. state to legally recognize same-sex marriage as a result of the decision of the Massachusetts Supreme Judicial Court in Boston. Many prominent American political dynasties have hailed from the Boston region, including the Adams and Kennedy families.\nHarvard University in Cambridge is the oldest institution of higher learning in the United States, with the largest financial endowment of any university, and whose Law School has spawned a contemporaneous majority of United States Supreme Court Justices. Kendall Square in Cambridge has been called \"the most innovative square mile on the planet\", in reference to the high concentration of entrepreneurial start-ups and quality of innovation which have emerged in the vicinity of the square since 2010. Both Harvard University and the Massachusetts Institute of Technology, also in Cambridge, have been ranked among the most highly regarded academic institutions in the world.\n\n"}}