{"Cary": {"Spring Hill (Raleigh, North Carolina)": "Raleigh (; RAH-lee) is the capital of the state of North Carolina and the seat of Wake County in the United States. Raleigh is the second-largest city in the state of North Carolina, behind only Charlotte. Raleigh is known as the \"City of Oaks\" for its many oak trees, which line the streets in the heart of the city. The city covers a land area of 142.8 square miles (370 km2). The U.S. Census Bureau estimated the city's population as 451,066 as of July 1, 2015. It is one of the fastest-growing cities in the country. The city of Raleigh is named after Sir Walter Raleigh, who established the lost Roanoke Colony in present-day Dare County.\nRaleigh is home to North Carolina State University and is part of the Research Triangle area, together with Durham (home of Duke University) and Chapel Hill (home of the University of North Carolina at Chapel Hill). The \"Triangle\" nickname originated after the 1959 creation of the Research Triangle Park, located in Durham and Wake counties, among the three cities and their universities. The Research Triangle region encompasses the U.S. Census Bureau's Raleigh-Durham-Chapel Hill Combined Statistical Area (CSA), which had an estimated population of 2,037,430 in 2013. The Raleigh Metropolitan Statistical Area (MSA) had an estimated population of 1,214,516 in 2013.\nMost of Raleigh is located within Wake County, with a very small portion extending into Durham County. The towns of Cary, Morrisville, Garner, Clayton, Wake Forest, Apex, Holly Springs, Fuquay-Varina, Knightdale, Wendell, Zebulon, and Rolesville are some of Raleigh's primary nearby suburbs and satellite towns.\nRaleigh is an early example in the United States (US) of a planned city. Following the American Revolutionary War when the US gained independence, this was chosen as the site of the state capital in 1788 and incorporated in 1792 as such. The city was originally laid out in a grid pattern with the North Carolina State Capitol in Union Square at the center. During the United States Civil War, the city was spared from any significant battle. It fell to the Union in the closing days of the war, and struggled with the economic hardships in the postwar period related to the reconstitution of labor markets, over-reliance on agriculture, and the social unrest of the Reconstruction Era.\nFollowing the establishment of the Research Triangle Park in 1959, numerous jobs were created in science and technology. The region and city have attracted a large influx of population, making it one of the fastest-growing communities in the United States by the early 21st century.\nRaleigh is home to numerous cultural, educational, and historic sites. The Duke Energy Center for the Performing Arts features three theater venues and serves as the home for the North Carolina Symphony and the Carolina Ballet. Coastal Credit Union Music Park at Walnut Creek is a large music amphitheater. Museums include the state museums of art, history and natural sciences, two in downtown. Major universities and colleges, in addition to those above, include Shaw University, the first historically black university in the American South. In the 1960s, the Student Nonviolent Coordinating Committee, an important civil rights organization, was founded here. One U.S. president, Andrew Johnson, was born in Raleigh."}}