{"Cary": {"Cary station (North Carolina)": "Cary  is the seventh-largest municipality in North Carolina. Cary is predominantly in Wake County, with a small area in Chatham County in the U.S. state of North Carolina and is the county's second-largest municipality and the third-largest municipality in The Triangle after Raleigh and Durham. The town's population was 135,234 as of the 2010 census (an increase of 43.1% since 2000), making it the largest town and seventh-largest municipality statewide. The U.S. Census Bureau estimates the town's population to be 159,769 as of July 1, 2015. Cary is the second most populous incorporated town (behind only Gilbert, Arizona) in the United States.\nAccording to the US Census Bureau, Cary was the 5th fastest-growing municipality in the United States between September 1, 2006, and September 1, 2007. In 2015 Cary had a low crime rate of 84 violent crimes per 100,000 residents. Charlotte, the largest city in North Carolina, had a violent crime rate of 648 violent crimes per 100,000 residents, almost 8 times higher than Cary.\nRaleigh, Durham, and Chapel Hill make up the three primary metro areas of the Research Triangle metropolitan region. The regional nickname of \"The Triangle\" originated after the 1959 creation of the Research Triangle Park, primarily located in Durham County, four miles from downtown Durham. RTP is bordered on three sides by the city of Durham and is roughly midway between the cities of Raleigh and Chapel Hill, and the three major research universities of NC State University, Duke University, and UNC-Chapel Hill.\nEffective June 6, 2003, the U.S. Office of Management and Budget (OMB) redefined the Federal statistical areas. This resulted in the formation of the Raleigh-Cary, NC Metro Area and the Durham-Chapel Hill, NC Metro Area.\nThe Research Triangle region encompasses OMB's Combined Statistical Area (CSA) of Raleigh-Durham-Chapel Hill in the central Piedmont region of North Carolina. As of 2012, the population of the Raleigh-Durham-Chapel Hill CSA was 1,998,808. The Raleigh-Cary Metropolitan Statistical Area (MSA) as of Census 2010 was 1,130,490."}}