{"Cary": {"Apex Union Depot": "The Apex Union Depot is a historic railroad station located on Salem Street in downtown Apex, North Carolina and is the centerpiece of the Apex Historic District. Constructed in 1914 by the Seaboard Air Line Railroad, the building shared service with the Durham and Southern Railway, but now houses the Apex Visitor's Center, Apex Chamber of Commerce, and meeting rooms rented out for special events. A 37-foot (11.3 m) Louisville and Nashville Railroad caboose is located beside the building. In December 1998 the Apex Union Depot was listed on the National Register of Historic Places.\nThe history of Apex revolves around the railroads and station. The town was named for being the highest point on the Chatham Railroad line between Richmond, Virginia and Jacksonville, Florida. In 1854 the first Apex railroad station was chartered. Over the next two decades, the land surrounding the station was developed and the town of Apex was incorporated in 1873. A new train depot was built in 1906 to accommodate the town's growth, but burned down in 1914. Later that year, the current facility was constructed. During the Great Depression, economic difficulties were responsible for a decrease in rail traffic. By 1934, only four stops were made at the Apex Union Depot. The decline continued until the 1960s when the Depot was closed and the building became the town's library. After a new library was built in 1996, the depot was renovated by the Apex Chamber of Commerce for use as its offices and a visitors' center. Freight trains and Amtrak's Silver Star pass by the station each day, with passenger trains stopping in nearby Cary.\nApex Union Depot is an example of Late Victorian architecture and features a double fireplace, ticket windows, and the original switchmen’s lanterns. The brick building was originally designed to segregate white and black riders. White people used a waiting room located on the left side of the depot. Women who were traveling alone used a room located behind one of the fireplaces."}}