{"Chicago": {"Kluczynski Federal Building": "The Kluczynski Federal Building is a skyscraper in the downtown Chicago Loop located at 230 South Dearborn Street. The 45-story structure was designed by Ludwig Mies van der Rohe and completed in 1974 as the last portion of the new Federal Center. It is 562 feet (171 m) tall and stands on the site previously occupied by the Chicago Federal Building by the architect Henry Ives Cobb. It was named in honor of U.S. Congressman John C. Kluczynski, who represented Illinois's 5th congressional district from 1951 to 1975 after his death that year. This is one of three buildings by van der Rohe in the Federal Center Plaza complex: the others are the US Post Office (Loop Station) and the Everett McKinley Dirksen United States Courthouse.\nThe Kluczynski Building is constructed of a steel frame and contains 1,200,000 sq ft (110,000 m2) of space. The exterior is sheathed in bronze-tinted glass set into bright aluminum frames. Beneath the windows are steel spandrel panels painted flat black and windows are separated horizontally by steel mullions of projecting steel I-beams also painted black. The two-story lobby is recessed allowing for a colonnade or pilotis to encircle the building at street level. The interior walls and floors of the lobby are covered in granite which entends to the plaza. The lobby contains several commemorative tablets which were removed from the previous building.\nThe entire complex is based on a 28 ft (8.5 m) grid pattern so that seams of the granite pavers in the plaza extend into the building lobbies and up the sides to create unity among the three structures. The Center resembles Mies' earlier Toronto-Dominion Centre and was expanded in 1991 with the addition of the 28-story Metcalfe Federal Building to the south across Jackson Boulevard.\nAlexander Calder's sculpture Flamingo, a 53-foot (16 m) red steel sculpture, was unveiled on the plaza October 24, 1974. The sculpture was conserved and restored in 1998. The plaza is also the site of a weekly farmers' market during the spring and summer seasons, open to the community.\nFederal agencies in the building include the Air Force Recruiting Service, the Department of State Passport Agency, Department of Labor, Internal Revenue Service, Office of Personnel Management, Consumer Product Safety Commission, General Services Administration and offices for both the U.S. senators from Illinois, Richard \"Dick\" Durbin and Tammy Duckworth.\nFollowing his election as president on November 4, 2008, Barack Obama set up transitional offices in the building, prompting heightened security measures in the surrounding area."}}