{"Chicago": {"Monadnock Building": "The Monadnock Building (historically the Monadnock Block; pronounced  mə-NAD-nok) is a skyscraper located at 53 West Jackson Boulevard in the south Loop area of Chicago, Illinois. The north half of the building was designed by the firm of Burnham & Root and built starting in 1891. The tallest load-bearing brick building ever constructed, it employed the first portal system of wind bracing in America. Its decorative staircases represent the first structural use of aluminum in building construction. The south half, constructed in 1893, was designed by Holabird & Roche and is similar in color and profile to the original, but the design is more traditionally ornate. When completed, it was the largest office building in the world. The success of the building was the catalyst for an important new business center at the southern end of the Loop.\nThe building was remodeled in 1938 in one of the first major skyscraper renovations ever undertaken—a bid, in part, to revolutionize how building maintenance was done and halt the demolition of Chicago's aging skyscrapers. It was sold in 1979 to owners who restored the building to its original condition, in one of the most comprehensive skyscraper restorations attempted as of 1992. The project was recognized as one of the top restoration projects in the USA by the National Trust for Historic Preservation in 1987. The building is divided into offices from 250 square feet (23 m2) to 6,000 square feet (560 m2) in size, and primarily serves independent professional firms. It was listed for sale in 2007.\nThe north half is an unornamented vertical mass of purple-brown brick, flaring gently out at the base and top, with vertically continuous bay windows projecting out. The south half is vertically divided by brickwork at the base and rises to a large copper cornice at the roof. Projecting window bays in both halves allow large exposures of glass, giving the building an open appearance despite its mass. The Monadnock is part of the Printing House Row District, which also includes the Fisher Building, the Manhattan Building, and the Old Colony Building.\nWhen it was built, many critics called the building too extreme, and lacking in style. Others found in its lack of ornamentation the natural extension of its commercial purpose and an expression of modern business life. Early 20th-century European architects found inspiration in its attention to purpose and functional expression. It was one of the first buildings named a Chicago Architectural Landmark in 1958. It was added to the National Register of Historic Places in 1970, and named as part of the National Historic Landmark South Dearborn Street – Printing House Row North Historic District in 1976. Modern critics have called it a \"classic\", a \"triumph of unified design\", and \"one of the most exciting aesthetic experiences America's commercial architecture produced\"."}}