{"Chicago": {"The Berghoff (restaurant)": "The Berghoff restaurant, at 17 West Adams Street, near the center of the Chicago Loop, was opened in 1898 by Herman Joseph Berghoff and has become a Chicago landmark.\nHerman Berghoff immigrated to America from Dortmund, Germany, in 1870. Herman and his three brothers, Henry, Hubert and Gustav, started brewing Berghoff's Beer in Fort Wayne, Indiana, in 1887. Herman wanted to expand the market for the family's beer and to do so he sold beer at the Chicago World's Fair of 1893.\nThe popularity of the beer inspired Herman to open a cafe to showcase Berghoff's Dortmunder-style beer which it sold for a nickel. Sandwiches were offered for free. The bar remained open even through the prohibition period by selling the legal near beer, which contained less than 0.5% alcohol, as well as a new line of Bergo soda pops, and expanded into a full-service restaurant. Berghoff root beer, a product of Bergo soda pops, is still popular today. After prohibition was repealed in 1933, The Berghoff was issued Chicago's Liquor License No. 1, a designation that has been honored by the city every year since. Long after most restaurants ended the practice, the Berghoff maintained a separate men's only bar. The segregation ended in 1969, when seven members of the National Organization for Women, led by Gloria Steinem, stood at the bar and demanded service.\nFor much of its history, the Berghoff waiters would purchase the meals they were serving from the kitchen via a token system and then deliver them to the customer, keeping the amount the customer paid for the meals.\nThe founding Herman Berghoff died unexpectedly at home on December 31, 1934. The restaurant was run by two of Herman's seven children, Lewis Windthorst and Clement Anthony, who had both joined their father in the business prior to his death. Under their helm, Berghoff's grew into three restaurants under one roof: the original bar, a large two-room restaurant, and a more casual downstairs cafe, called the Annex, which was opened in 1939.\nLewis and Clement were active in the restaurant until about 1960. To succeed themselves, they brought in siblings from each family, one being third-generation Herman Berghoff (Lewis's son). Management styles differed and, in 1973, Herman withdrew and moved with his wife and four children to Stevensville, Michigan. However, in 1983 Herman was asked to return by the remaining Berghoff partners. He offered to buy them out, and became the sole owner and runner of the restaurant (with his wife Jan Berghoff) in 1986.\nOn December 28, 2005, it was announced by Herman Berghoff, 70, and his wife Jan Berghoff that after 107 years of operation, The Berghoff would close on February 28, 2006.\nThe restaurant's basement cafe reopened on April 18, 2006, during weekday lunch hours only, and was run by Carlyn Berghoff, Herman and Jan's daughter and the great-granddaughter of the founding Herman Joseph Berghoff. She also reopened the Berghoff's bar on May 23, 2006, under the new name \"17/West at The Berghoff.\" At one point, Carlyn Berghoff converted the dining room of the restaurant into a private banquet hall called \"The Century Room,\" however, after a year under new ownership, The Berghoff re-launched their full-service restaurant. The Berghoff Cafe at O'Hare Airport also remained open. Carlyn Berghoff also operated a catering company within the restaurant, resulting in the official name of the enterprise: Berghoff Catering & Restaurant Group. The Berghoff Brewery was sold to the Falstaff company in 1954. The Huber company began brewing the beers in 1960 under contract, and purchased the brand from the Berghoff family in 1995. The Berghoff beers include their Bock, Genuine Dark, Hazelnut Winterfest, Hefeweizen, and Honey Maibock. Berghoff beer is currently owned by Point Brewing Company\nIn 2016, Carlyn Berghoff, CEO of Berghoff Catering & Restaurant Group, transitioned out of the restaurant by selling her assets to Berghoff Restaurant Company of Delaware, which is owned and operated by her brother, Pete Berghoff. July 1, 2016, marked the first day that Berghoff Restaurant Company of Delaware began managing operations at 17 West Adams. Currently, the Berghoff Company operates the full-service restaurant, public bar, and cafe."}}