{"Cleveland": {"1936 Republican National Convention": "The 1936 Republican National Convention was held June 9–12 at the Public Auditorium in Cleveland, Ohio. It nominated Governor Alfred Landon of Kansas for President and Frank Knox of Illinois for Vice President.\nThe convention supported many New Deal programs, including Social Security. The keynote address was given on June 9 by Frederick Steiwer, U.S. Senator from Oregon\n\nAlthough many candidates sought the Republican nomination, only two, Governor Landon and Senator Borah, were considered to be serious candidates. While favorite sons County Attorney Earl Warren of California, Governor Warren E. Green of South Dakota, and Stephen A. Day of Ohio won their respective primaries, the 70-year-old Borah, a well-known progressive and \"insurgent,\" carried the Wisconsin, Nebraska, Pennsylvania, West Virginia, and Oregon primaries, while also performing quite strongly in Knox's Illinois and Green's South Dakota. However, the party machinery almost uniformly backed Landon, a wealthy businessman and centrist, who won primaries in Massachusetts and New Jersey and dominated in the caucuses and at state party conventions.\nOther potential candidates included Robert A. Taft, New York Congressman James W. Wadsworth, Jr., Michigan Senator Arthur Vandenberg, Iowa Senator Lester Dickinson, New York Congressman Hamilton Fish III, New Jersey Governor Harold Hoffman, Delaware Governor C. Douglass Buck, Supreme Court Justice Owen Roberts, Michigan Auto magnate Henry Ford, aviator Charles Lindbergh, former President Herbert Hoover, Oregon Senator Frederick Steiwer, Senate Minority Leader Charles McNary, former Treasury Secretary Ogden L. Mills and Theodore Roosevelt, Jr., cousin of Democratic incumbent Franklin D. Roosevelt.\nAt the start of the convention, Landon looked like the likely nominee, but faced opposition from a coalition led by Michigan Senator Arthur Vandenberg, Idaho Senator William E. Borah, and newspaper publisher Frank Knox. However, the stop-Landon movement failed.\n\nThe tally of the first ballot at the convention was:\nAlfred Landon 984\nWilliam Borah 19\nKnox was nominated for vice president."}}