{"Cleveland": {"Cleveland Public Library": "The Cleveland Public Library was founded in 1869 and is located in Cleveland, Ohio. It operates the Main Library on Superior Avenue in downtown Cleveland, 27 branches throughout the city, a mobile library, a Public Administration Library in City Hall, and the Ohio Library for the Blind and Physically Disabled.\nLibrarian William Howard Brett opened the library's first stand-alone children's room on February 22, 1898. Effie Louise Power was appointed Cleveland's first children's librarian.\nIn 1915, the Cleveland architectural firm of Walker and Weeks won a competition to design a new library building. Construction of their classical Renaissance design, delayed by the First World War, began in 1923 under Linda Anne Eastman. Eastman (1867–1963) was the first woman to head a major U.S. city library system and a pioneer in the modern library system. She opened bookshelves to patrons, replacing the New York Public Library system in which a librarian fetched the books.\nThe Main Library consists of two buildings. The older wing, completed on May 6, 1925 and renovated between 1997 and 1999, has five stories, each as high as two stories in most buildings. The renovations included the restoration of a large mural painted by Ora Coltman in 1934 for the Federal Arts Project. The work was done by the Intermuseum Conservation Association. The second building, named after former U.S. Congressman Louis Stokes, was dedicated in 1997. The two buildings are connected by underground corridor below the Eastman Reading Garden, which was designed by landscape architecture firm OLIN, and includes sculptures by Maya Lin and Tom Otterness.\nThe Main Library's special collections include the Mears and Murdock baseball collections, the Cleveland Theater collection, the John G. White chess and checkers collection, a 130,000-volume children's collection, a 74,000-volume rare book collection, and collection of 1.3 million photographs.\nIn 2002, the Cleveland Public Library had annual attendance of 804,692 and an annual circulation of 1,698,928 items. In 2016, the library's collection totaled 10,557,336 items. The Cleveland Public Library is a member of CLEVNET, a consortium of 44 public libraries throughout northern Ohio. In 1947, it became a depository library for the United Nations Library network, holding documents for the state of Ohio. There are only 400 UN depository libraries worldwide.\nIn 2012, the Library released a strategic plan focusing on communities of learning and preparing for its 150th anniversary in 2019."}}