{"Cleveland": {"The Mall (Cleveland)": "The Cleveland Mall is a long public park in downtown Cleveland, Ohio. It was conceived as part of the 1903 Group Plan by Daniel Burnham, John Carrère, and Arnold Brunner as a vast public space flanked by the city's major civic and governmental buildings, all built in the neoclassical style. Many of those buildings were built over the following three decades, including the Metzenbaum Courthouse (1910), Cuyahoga County Courthouse (1912), Cleveland City Hall (1916), Public Auditorium (1922), the Cleveland Public Library main building (1925), and the Cleveland Public Schools Board of Education building (1931). Other buildings include Key Tower, the Global Center for Health Innovation, the Hilton Cleveland Downtown Hotel, and the Federal Reserve Bank of Cleveland.\n\nIn the spirit of the City Beautiful movement, formerly seedy areas were transformed into a \"magnificent civic center\", which was supposed to be crowned by the Union Terminal at the north end of the mall, on the shores of Lake Erie. However, the location of the station was eventually moved south and west, to Public Square, where it was finally born as the Terminal Tower. Even though the plan was never fully carried out, it was one of the few City Beautiful plans to be realized to a large extent, and remains one of the most complete examples in the United States. The Mall was added to the National Register of Historic Places in 1975.\nThe Mall is divided into three sections, known as Malls A, B, and C. Mall A, the southernmost, is officially named Veterans' Memorial Plaza, and Mall C was dedicated as Strawbridge Plaza in 2003. The Memorial Plaza, between Rockwell and St. Clair Avenues, is the site of the Fountain of Eternal Life, also known as the War Memorial Fountain. The Cleveland Convention Center was built underneath Malls B and C in 1964. In 2010 the county purchased the underground convention center from the city as part of a project to completely rebuild it in conjunction with constructing the Global Center for Health Innovation and the Hilton Cleveland Downtown Hotel on the former site of the Cuyahoga County Administration Building across from Mall B. The new Huntington Convention Center of Cleveland opened in 2013 and has underground connections to Public Auditorium and the Global Center for Health Innovation. The Hilton officially opened in June 2016. Mall B and Mall C reopened after construction as predominantly grassy areas, with Mall B reaching 27 feet above sidewalk level over the entrance to the Cleveland Convention Center along Lakeside Avenue."}}