{"Fort_Lauderdale": {"Bienes Museum of the Modern Book": "The Bienes Museum of the Modern Book, previously known as the Bienes Center for the Literary Arts, is the rare book department located on the 6th floor of Broward County's Main Library in Fort Lauderdale, Florida, United States. The Broward County Libraries Division's Bienes Museum of the Modern Book opened to the public on December 5, 1996 with James A. Findlay as the first Museum Librarian. The Bienes Museum is home to special collections totaling more than 15,000 items, including rare books, artifacts, manuscripts, and reference materials. The Museum was started with the help of philanthropists Diane and Michael Bienes' donation of $1 million. Support for the start of the Bienes Museum of the Modern Books was also provided by a grant from the Broward Public Library Foundation. Additional funding was also received from the Florida Department of State Division of Cultural Affairs and the Florida Arts Council. The Bienes' also donated many books and artifacts from their personal collection in order to add to the collection of items housed by the Museum. The Bienes Museum is housed in an 8,300 square foot facility that was designed by architect Donald Singer. The Museum has a curved wood ceiling above slatted wood walls with a combination of glass, granite and ceramic tiles. The Museum has a 25-seat conference room and a 60-seat Ceremonial Room that is available for lectures and programs.\nThe Bienes Museum houses important collections including the Jean Fitzgerald WPA Federal Writers' Project; WPA Museum Extension Project; WPA and other New Deal agencies, 1932–1942; the Paulette and Robert Greene Collection of Books about Books and Florida Fine Press publications; Floridiana (including archives and papers of the Florida authors Charles Willeford, Michael Shaara, Connie May Fowler and Olivia Goldsmith); Florida Artists' Book Collection; J.D. MacDonald Collection; Siers Collection of Big Little Books; Deicke Collection of Books on Rare Tropical Fruits and Vegetables; Nyr Indictor Collection of ABC Books and Related Materials; and Vojtech Kubasta pop-up and other books.\nThe Bienes Museum of the Modern Book features the following children's literature and artifacts in its collection:\nNyr Indictor Collection of Alphabet and Related Materials. This collection contains over 2,000 items that recorded in detail the worldwide development of the 19th and 20th century alphabets. The collection contains ABC books in the following languages: Arabic, Cherokee, Chinese, Dutch, English, Esperanto, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Italian, Japanese, Korean, Norwegian, Polish, Portuguese, Russian, Serbo-Croatian, American Sign Language, Spanish, Swahili, Swedish, Thai, Ukrainian, and Yiddish. The collection also contains items such as toys and games, ceramics, clothing, rubber stamps, flash cards, jigsaw puzzles, and wrapping paper.\nJean Trebbi ABC Collection. This collection contains over 300 alphabet books which were collected over a period of 20 years. The collection includes first editions, signed and numbered copies, artists' books, and other rare and out of print titles dating from the late 19th century to the present.\nDuane H. Siers Family Collection of Little Books. This collection features 500 Big Little Books dating from 1932-1970s. These books were donated in 1986 by Duane Siers from his personal collection. These books were first published by the Whitman Company in 1932. The Big Little Books are 4 1/2 inches high and 3 3/4 inches wide and contain black and white illustrations with color covers. The books are based on comic strips, movies, radio shows, and children's classics and feature characters like Dick Tracy, Flash Gordon, Blondie, Dagwood, Little Orphan Annie, Mickey Mouse, Tom Mix, and Tarzan.\nBienes Museum Comic Books Collection. This collection features approximately 2,400 vintage comic books dating from the 1950s to the 1980s. The collection contains the following titles: The Amazing Spider-Man, Archie, Betty and Veronica, Daredevil, The Defenders, The Fantastic Four, The Incredible Hulk, Iron Man, Jughead, Marvel Tales, Marvel Team-Up, The Sub-Mariners, and Star Wars.\nCollection of Books Illustrated by Leonard Everett Fisher. This collection features approximately 140 titles by Leonard Everett Fisher who is a well known author and illustrator of more than 260 books for young readers since 1955. Fisher has been honored with the 1981 Jewish Book Award for Children's Literature and the Christopher Medel for Illustration.\nCollection of Vojtech Kubasta works. This collection features works by Vojtech Kubasta who is a Czech paper engineer, children's book illustrator, and graphic designer. Included in the collection are 315 advertisements, calendars, flat books, maps, models, pop up books and greeting cards, portfolios, postcards, posters, prints, and stationary. The Bienes Museum started collecting his works in 2001 and now has the largest public institutional collection in the United States.\nIt also hosts special exhibits and other festivals."}}