{"Fort_Lauderdale": {"Seven Isles (Fort Lauderdale)": "The Seven Isles neighborhood comprises 315 households, with approximately 1,145 residents, and is situated north of Las Olas Boulevard. The Intracoastal Waterway borders the east and north boundaries, while the neighborhoods of Sunrise Key and Sunrise Intracoastal are to the north, the neighborhood of Central Beach is east of it, the neighborhoods of Idlewyld and Riviera Isles are to the south, Las Olas Isles is located southwest of it, and the neighborhood to the west of the Intracoastal Waterway is Nurmi Isles. There are nine streets within the Seven Isles: Aqua Vista Boulevard, Barcelona Drive, Castilla Isle, Del Mar Place, De Sota Drive, De Sota Terrace, Pelican Isle, Sea Island Drive and Seven Isles Drive.\nW.F. Morang arrived in Fort Lauderdale from Boston in the early 1920s and participated with other developers in the land boom era of 1923 to 1926. His company, W.F. Morang & Sons, Inc., helped develop and dredge some of the finger islands around the city including the 80 acres (320,000 m2) currently called the Seven Isles. Within these 80 acres (320,000 m2), his first projects included Rio Vista Isles where he dredged canals and built roads and bridges before dredging the area north of Las Olas Boulevard, which back then was called \"Lauderdale Isles\" (not to be confused with the present-day Lauderdale Isles neighborhood across from Riverland Village,) which included the isles of Aqua Vista, Barcelona, De Sota, Sea Island and Pelican Isle, as well as \"Lauderdale Shores\" (which includes Castilla and Del Mar).\nThe names of the seven isles are Aqua Vista (which means \"Water View\" in Latin,) Barcelona (after the city in Spain,) Castilla (a feminine noun of the Spanish word \"Castle\" or \"Castillo,\") Del Mar (which means \"Of the Sea,\" in Spanish,) De Sota (which is a feminine form of the Spanish conquistador, Hernando De Soto's last name,) Pelican Isle, and Sea Island.\nThough Morang built no homes and never completed the project, he began the building of a hotel. The Croissantania, at the eastern end of Aqua Vista Boulevard. The hotel had foundation work and walls, but construction was halted due to a material shortage which affected all of Southeast Florida after a steel yacht called the Prinz Valdemar, reputedly owned by German Kaiser Wilhelm I, mysteriously sank across the mouth of the harbor of Miami (present-day Port of Miami.)\nThis disaster shut off the major entry source of building materials for this project. The venture ended with the disastrous September 17, 1926 hurricane. The plans to dig Port Everglades were drawn and approved in 1926 due to the shutdown of Miami’s harbor, but it was many years until the port was put into use.\nAs part of the promotion for the sale of the then named \"Lauderdale Isles-Lauderdale Shores,\" Morang erected massive twin columns based on two pedestals as a gateway to his development. The pedestals were set approximately 25 feet (7.6 m) apart and the columns extended skyward some forty feet. They were aligned on either side of a long canal giving maximum visual effect to someone standing on East Las Olas Boulevard and looking due north. At the north side of the seawall between the columns, a boat dock ramp was constructed and Mr. Morang hired a boat captain to conduct free sightseeing tours to prospective buyers.\nThe Florida land boom era came to an end after the September 1926 hurricane, which did extensive damage to Fort Lauderdale and toppled the twin columns on East Las Olas Boulevard. Only the most easterly pedestal remains where it has sat on its original site since being built in 1925. During the East Las Olas road renovation of 1995, the pedestal was slated for demolition. A resident of Seven Isles, Diane Hess, petitioned the City to save the structure, initiated a campaign to obtain its historic designation status and raised funds (including a matching grant from the State of Florida) to preserve and conserve the pedestal. The surviving pedestal stands 120 feet (37 m) west of Seven Isles Drive.\nThe original plats for the development subdivided the 80 acres (320,000 m2) into 50-foot (15 m) lots. Between 1928 and 1937, the lots were re-platted and consolidated into acreage. Between 1937 and 1952, the land was again re-platted and the acreage converted back into individual lots. These lots encompassed a variety of widths: most in excess of 75 feet (23 m), many over 100 feet (30 m). With the exception of one, all the original 50-foot (15 m) lots were either re-platted into bigger lots, or through land sales, were merged with adjacent lots.\nSeven Isles Drive was originally called Southeast 23rd from East Las Olas Boulevard to Pelican Drive where, at that point – for the city’s demarcation for areas N.E. and S.E. Broward Boulevard – it became Northeast 23rd Avenue. In 1986, the neighborhood, through the efforts of a hard-working, industrious resident, formed the Seven Isles Homeowners’ Association. The Association had the name of 23rd Avenue changed to Seven Isles Drive. With a majority of residents making a significant contribution, the guardhouse was designed by a resident of Seven Islands and then built.\nThe Seven Isles Security Fund, Inc., was incorporated and became separate from the Seven Isles Homeowners' Association. The Seven Isles Homeowners’ Association was later dissolved by the Board of Directors and the by-laws rewritten to combine the Homeowners’ Association and the Security Fund under the name of the Seven Isles Security Fund, Inc. However, due to recent growth in the Seven Isles and thus the broadening scope or supervisory responsibilities – security, capital improvements and aesthetics – the name was amended in 2000 to reflect the larger breadth of duties. The Seven Isles Homeowners’ Association is now the sole body overseeing the community’s needs."}}