{"Fort_Lauderdale": {"Miami metropolitan area": "The Miami metropolitan area, also known as the Greater Miami Area or South Florida, is the 73rd largest metropolitan area in the world and the eighth-largest metropolitan area in the United States. It is entirely located in the southern portion of the U.S. state of Florida. With 6,066,387 inhabitants as of 2016, the Miami metropolitan area is the most populous in Florida and second largest in the southeastern United States.\nThe metropolitan area is defined by the Office of Management and Budget as the Miami–Fort Lauderdale–West Palm Beach, FL (MSA), consisting of Miami-Dade, Broward, and Palm Beach counties, a metropolitan statistical area used for statistical purposes by the United States Census Bureau and other agencies. Its land area is 6,137 sq. mi (15,890 km2).\nMiami-Dade, Broward, and Palm Beach counties are the first, second, and third most populous counties in Florida, and Miami-Dade, with 2,693,117 people in 2014, is the seventh most populous county in the United States. The three counties together have principal cities including Miami, Fort Lauderdale, Pompano Beach, West Palm Beach, and Boca Raton. Besides its association with the South Florida region, is also partially synonymous with an area known collectively as the \"Gold Coast\".\nThe Census Bureau also defines a wider region based on commuting patterns, the Miami–Fort Lauderdale–Port St. Lucie, FL Combined Statistical Area (CSA), also known as the Greater Miami Area, with an estimated population of 6,723,472 in 2016. This includes the four additional counties of Martin, St. Lucie, Indian River, and Okeechobee.\nBecause the population of South Florida is largely confined to a strip of land between the Atlantic Ocean and the Everglades, the Miami urbanized area (that is, the area of contiguous urban development) is about 100 miles (160 km) long (north to south), but never more than 20 miles (32 km) wide, and in some areas only 5 miles (8.0 km) wide (east to west). The Miami metropolitan statistical area is longer than any other urbanized area in the United States except for the New York metropolitan area. It was the eighth most densely populated urbanized area in the United States in the 2000 census.\nAs of the 2000 census, the urbanized area had a land area of 1,116 square miles (2,890 km2), with a population of 4,919,036, for a population density of 4,407.4 per square mile (1,701.7 per square kilometer). Miami and Hialeah (the second largest city in the metropolitan area) had population densities of more than 10,000 per square mile (more than 3,800 per square kilometer). The Miami Urbanized Area was the fourth largest urbanized area in the United States in the 2010 census.\nThe Miami metropolitan area also includes several urban clusters (UCs) as of the 2000 Census which are not part of the Miami Urbanized Area. These are the Belle Glade UC, population 24,218, area 20,717,433 square meters and population density of 3027.6 per square mile; Key Biscayne UC, population 10,513, area 4,924,214 square meters and population density of 5529.5 per square mile; Redland UC, population 3,936, area 10,586,212 square meters and population density of 963.0 per square mile; and West Jupiter UC, population 8,998, area 24,737,176 square meters and population density of 942.1 per square mile."}}