{"Fort_Lauderdale": {"Bryan Building": "The Bryan Building, which has also been known as the Shepherd Building and as the DeSoto Hotel, is a historic site in Fort Lauderdale, Florida. It is located at 220-230 Brickell Avenue. In 1997 it was added to the U.S. National Register of Historic Places.\nIt is a two-story masonry vernacular building. It has brick detailing and brick columns in its front facade. The brick facade is unusual in south Florida, most buildings there are constructed of poured concrete or hollow clay tile. It is a rectangular building that faces west with five storefronts, separated by brick pilasters that have large plate glass windows. The upper floor has eight windows with brick framing resembling a simplified Greek key design. The first and second floor are divided by a cast stucco course with a projecting pediment, below which is an arched door. The south side of the building has four ground floor windows and two doorways the back one leading to a stairway to the second floor and the one on the southwest corner served as the entrance to offices. On this side the first and second floors are divided by a single band of raised brick. The upper story windows are detailed similarly to those on the west side. Primary access to the upper floors has been via a stairway inside the west-facing arched doorway. The upstairs floor and ceiling were constructed of Dade County Pine.\nIt was built by Thomas Bryan after the 1912 fire in downtown Fort Lauderdale, and, as of its NRHP listing, was the least altered building of its era in the area. Thomas was the son of Nathaniel Bryan who supervised construction of the extension of Henry Flagler's Florida East Coast Railway from West Palm Beach to Miami. He was active in the development and city affairs of Fort Lauderdale and is his activities helped lead to the establishment of Broward County. The area the building is located in was Fort Lauderdale's original downtown commercial center.\nThe Post Office was located in the building frome 1914 to 1925, about this time The Fort Lauderdale Bank also occupied the ground floor. From the 1920s to the early 1990s the second floor was a hotel or rooming house. Hotels in the building included the Hotel DeSoto (1919 to at least 1927), the Lee Hotel (1936-1938), the Hotel Boriss (1940-1946) and the Dorsey Hotel (1950-1965) a men only hotel with a cowboy motif. The law offices of attorney and City Judge Ennis Shepherd occupied a portion of the ground floor from 1947 to the early 1900s. Read's Dry Goods where locals often purchased materials to make clothes, other dry goods merchants, beef purveyors, real estate offices and insurance agencies were among other tenants. Fort Lauderdale's downtown business district declined in the 1960s due to suburbanization. The building got a historically appropriate renovation about 1998."}}