{"Fort_Lauderdale": {"110 Tower": "110 Tower, formerly known as AutoNation Tower, is a 410.1 feet (125.0 m) modernist office building in downtown Fort Lauderdale, Florida. The building was one of the first modern high-rise office buildings constructed in the city, and became part of the city's sprawling skyline. The building has a baltic-brown granite clad and glass exterior, it currently stands as the third tallest building in Ft. Lauderdale's skyline, and also the tallest office building.\n110 Tower is located adjacent to the Broward County Courthouse in Fort Lauderdale's Justice District along 6th Street. It is across the street from the new 27 story Broward County Courthouse Building that will begin construction in October 2011.\nIn October 2005, Hurricane Wilma struck South Florida and damaged the building's facade, including several windows. The most notable damage was the removal of the blue neon lighting that lined the top of the building which was blown off by high winds. The lighting was replaced in 2010 with LED lights that allow the building lines to be highlighted with multiple colors. In September 2010, the building's master tenant, AutoNation, moved out of the building when its lease expired, leaving the building half empty.\nWith the building half empty the owners, Genesis Capital Partners XI, Ltd., took the opportunity to substantially renovate the building. In October 2010, 110 Tower began undergoing the substantial $31 million renovation of the building's heating, ventilation, and air conditioning systems as well as the renovation of the common areas and exterior. Most floors were gutted to the slab, enabling the owners to replace obsolete electrical systems, HVAC, and water systems with modern, sustainable technologies. These improvements enabled the building to earn the Energy Star Rating in September 2011, as well as being awarded the LEED EB Gold designation by the U.S. Green Building Council that year. Also in 2011, 110 Tower was named LEED E.B. Gold Building of the Year by the South Florida chapter of the U.S.G.B.C., and the city of Fort Lauderdale recognized 110 Tower's sustainable efforts by naming Thursday, September 7, 2011, as 110 Tower Day. The future of the South Side of Downtown Fort Lauderdale is improved substantially with renovation of 110 Tower, the construction of the new Broward County Courthouse, and the planned addition of surface rail along 6th Street that will serving the downtown and waterfront areas of Fort Lauderdale."}}