{"Fort_Lauderdale": {"Hacienda Village": "Hacienda Village (founded 1949) is a defunct town located in central Broward County, Florida in the United States. It possessed both a police and fire department as well as various other municipal agencies, yet still relied heavily on Broward County for many services. It was disincorporated in 1984 (allegedly having its charter revoked after the HVPD cited an influential state representative for a traffic infraction) and was subsequently absorbed into the nearby town of Davie, Florida.\nThe community had a reputation for being a \"speed trap.\" Steve Weller of the Fort Lauderdale Sun Sentinel stated that while Patton Village, Texas, an area known for a \"speed trap,\" had reduced its monthly citation count from 1,100 to 400, \"They tell me that, on a really cranky day, Hacienda Village speed trappers could issue that many tickets before lunch.\" The Mayor of Hacienda Village, \"Red\" Crise, originally from New Jersey, appointed himself the Police Chief, Fire Chief and Judge Magistrate. Crise presided over some 18 police officers as well as over a nightly traffic court. He apparently gloried in his reputation as a difficult person, once saying \"If you're a redheaded man, you're either a sissy or a son of a bitch. I'm not a sissy.\"\nThere was a highly visible Country & Western Nightclub called, \"The Hacienda Inn\" housed in a large building painted with huge contrasting polka dots. \"Red\" Crise was the owner/operator. As you passed through the front doorway, there was a sign that said, \"No Hats\". Hats had been known to \"cause fights\". Blacklights were used for lighting all but the bandstand causing the bottles of beer and people's teeth to glow. Local C & W bands played from 9:30 p.m. until 4:00 a.m. A jukebox supplied music during the band's 20 minute breaks.\nHacienda Village was composed of 14 mobile homes and three junkyards. Residents were not taxed, as the town always had a healthy surplus of funds from traffic fines. The fines were a result of some fancy and obscure speed limit postings which were heavily enforced by highly efficient police officers.\nAs with Andytown, it was crippled by the construction of the interstate system, for the Interstate 595 spur, along the State Road 84 corridor, removed most of its revenue, rerouting traffic from SR 84 to I-595. I-595 runs from the Hollywood/Fort Lauderdale International Airport at US 1 to the junction of I-75, where it veers west towards Andytown and Naples."}}