{"Fort_Lauderdale": {"Boyd H. Anderson High School": "Boyd H. Anderson High School (also called \"Boyd Anderson\", or \"B.A.\", located in Lauderdale Lakes, Florida) is an suburban high school in Broward County. Boyd H. Anderson serves Lauderdale Lakes, and parts of Tamarac, North Lauderdale, Oakland Park, Fort Lauderdale and Lauderhill. Boyd H. Anderson High School is located in Lauderdale Lakes, Florida. We serve 1900 students who have the opportunity to enroll in one of our two Magnet programs. The International Baccalaureate (IB), which houses the Middle Years Programme, the Career-related Programme, as well as the Diploma Programme, gives students the opportunity to engage in a curriculum that gives a global perspective, while preparing them for exams that will earn them up to 4 semesters of college credits and the possibility of a guaranteed Bright Futures Academic Scholarship. The school also has a Health and Wellness Program, which, prepares students to get State certified in Electrocardiogram (EKC), Certified Medical Administrative Assistant (CMAA), and Personal Training. The Culinary program prepares students to gain certification in Self Serve and Prostart, which enables students to apply for jobs in local restaurants and hotels.\nThe school is named after the third County Judge of Broward County, Boyd H. Anderson, Sr., who served from 1933 to 1968.\nThe school mascot is the cobra and the school colors are orange and black.\nBoyd Anderson had a Florida Comprehensive Assessment Test school grade of \"C\" for the 2011-2012 academic year.\nBoyd Anderson High School is the first public school in Broward County to contain an accredited International Baccalaureate diploma program as a magnet program. It gained this distinction in December 1985. In September 2005, it began offering the \"Middle Years\" program.\nThe school also has a Health and Wellness magnet program, headed by Mrs. Ashley Underhill. Additionally, the school offers dual enrollment courses such as ENC101 Composition, Transportation, and Safety.\nThe school's track and field teams reached three state championships in Track and Field (1995, 1997, 2000), three state championships in Cross Country (1992, 1996, 1998), and ranked #2 nationally in Track and Field (1998), and 18th in Cross Country. This was all achieved under former coach David Bowden. They won the 5A Basketball State Championship in 1994 under coach Mike Benanti.\nIn addition to successful athletic programs, the school also had success in forensics or speech & debate. In 2010, Fort Lauderdale attorney Jonathan Pollard started a debate team at Boyd Anderson that competed in the Florida Forensic League. In the second year of the debate team, two Boyd Anderson Students, Daniel Nelson and James Fishback, advanced from the South Florida region to the National Forensic League National Championship Tournament. Fishback earned 9th place in the country.\nBoyd Anderson also maintains several community service-based organizations including: Key Club (headed by Ms. Alina McCullen; President Kayla Marshall), Students Helping Achieve Philanthropic Excellence, Ladies of Distinction (both headed by Mrs. Yulanda C. Ellis; President Deja Boyd), Brother to Brother (headed by Mr. Basil Farrington; President Mark Laing), Sister to Sister (headed by Ms. LaShondra Taylor; President Veronica Smith ), and Gentlemen of Distinction (headed by First Sergeant Dinkins; (Founded by Eddie Z. Oliver, Jr.) President Shaun Grant.\nIn November 2009, Boyd Anderson opened the new multimillion-dollar cafeteria to students, faculty, and staff. The cafeteria is equipped with a teacher's lounge area, eight LCD flat screen televisions, and new staff.\nOn April 4, 2009, 16-year-old Boyd H. Anderson student Gregory Smith was shot and killed during a robbery outside the school."}}