{"Hampton": {"Full-Scale Wind Tunnel": "The Full-Scale Tunnel (abbreviated FST, also known as the 30-by 60-Foot Tunnel) was a wind tunnel at NASA's Langley Research Center. It was a National Historic Landmark.\nIn 1929, National Advisory Committee for Aeronautics began construction of the world's first full-scale wind tunnel. The design team was led by Smith J. DeFrance. The tunnel was completed in 1931 (dedicated 27 May) at a cost just under $900,000. It was a double-return tunnel capable of moving air at speeds up to 118 miles/hour (190 km/h) through its circuit. It had a 30 ft by 60 ft (9.1 m x 18.3 m) open throat, which is capable of testing aircraft with spans of 40 ft (12.2 m).The wind tunnel is a double-return, atmospheric pressure tunnel with two fans powered by 4,000 hp electric motors.\nThe Vought O3U-1 biplane observation airplane was the first complete airplane tested in the tunnel. After that, it was used to test virtually every high-performance aircraft used by the United States in World War II. For much of the war, when it was operational 24 hours a day, seven days a week, the full-scale tunnel was the only tunnel in the free world large enough to perform these tests.\nAfter the war, many types of aircraft were tested in the tunnel including the Harrier Jump Jet fighter, the F-16, the American supersonic transport, the Space Shuttle and Lunar Landing Test Vehicle. During the 1950s and 1960s, the tunnel was modified and upgraded several times. The principal improvement was adding the ability to test free-flying scale models in the test throat. The wind tunnel was in use through the 2000s, testing procedures such as free-flight and high angle of attack.\nIt was declared a National Historic Landmark in 1985. However, despite this designation and the efforts of some aviation historians, demolition of the tunnel began in 2010.  It was documented before its demolition, with the fan blades being salvaged for display. In 2014 its landmark designation was withdrawn and it was removed from the National Register of Historic Places."}}