{"Hampton": {"War Memorial Stadium (Hampton)": "War Memorial Stadium is a stadium in Hampton, Virginia. It is primarily used for baseball and has been the home of the various incarnations of the Peninsula Pilots, including the current Coastal Plain League incarnation. It is also the home for the Apprentice School Builders college baseball team. The ballpark has a capacity of 3,750 people and opened in June, 1948.\nPeninsula War Memorial Stadium was designed by the legendary Branch Rickey as an affiliate for his Brooklyn Dodgers. The Newport News Dodgers won 3 Piedmont League Championships before Brooklyn moved to Los Angeles and the Dodgers were no more in 1958. In 1963 the Carolina League came to the Stadium as the Top Class \"A\" club of the Washington Senators. The Peninsula Grays were born. The Cincinnati Reds followed with Hall of Fame catcher Johnny Bench playing in the Stadium in 1965. The 1965 team also won the pennant for best record but lost in the playoffs. The Kansas City/Oakland \"A\"s followed until 1968 when the Astros came in. The following started a great era: the era of the Phillies. The name Astros was kept for 1969 when the Phillies came knocking. That's when the club adopted the nickname Peninsula Pilots, which was used 1971, 1976–1986, 1989–1992. The Phillies were Peninsula's affiliate for much of that time winning 7 Carolina League Division Championships, including 6 trips to the Carolina League Championship Series. In 1980 the club had a record of 100-40 and swept the Durham Bulls in the League Championship Series. That team had a .714 winning percentage, which was the best in Carolina League history. It still stands as one of the top 20 all-time records in professional baseball history. The Seattle Mariners were the affiliate in Peninsula's last season and won the CL Championship. Then the era of professional baseball on the peninsula that dated back to 1893 was over. The team is honored by the Peninsula Pro Baseball Alumni Association and the Peninsula Professional Baseball Hall of Fame. Inductee and chairman is longtime Peninsula executive John Graham. War Memorial Stadium celebrated its 60th anniversary in 2008.\n\n"}}