{"Hampton": {"Hampton Roads": "Hampton Roads is the name of both a body of water in Virginia and the surrounding metropolitan region in Southeastern Virginia and Northeastern North Carolina, United States. Comprising the Virginia Beach–Norfolk–Newport News, VA–NC metropolitan area and an extended Combined Statistical Area that includes the Elizabeth City, NC Micropolitan Statistical Area and Kill Devil Hills, NC Micropolitan Statistical Area, Hampton Roads is known for its large military presence, ice-free harbor, shipyards, coal piers, and miles of waterfront property and beaches, all of which contribute to the diversity and stability of the region's economy.\nThe body of water known as Hampton Roads is one of the world's largest natural harbors (more accurately a roadstead or \"roads\"). It incorporates the mouths of the Elizabeth River, Nansemond River, and James River with several smaller rivers and empties into the Chesapeake Bay near its mouth leading to the Atlantic Ocean.\nThe land area (also known as \"Tidewater\") includes a collection of cities, counties and towns on the Virginia Peninsula and in South Hampton Roads. Some of the outlying areas further from the harbor may or may not be included as part of \"Hampton Roads\", depending upon the organization or usage. For example, as defined for federal economic purposes, the Hampton Roads metropolitan statistical area (MSA) includes two counties in northeastern North Carolina and two counties in Virginia's Middle Peninsula. The Virginia Beach–Norfolk–Newport News, VA–NC MSA has a population of over 1.7 million, making it the 37th-largest metropolitan area in the United States. The Combined Statistical Area includes four additional counties in North Carolina, pushing the regional population to over 1.8 million residents, the 32nd largest CSA in the country.\nThe area is home to hundreds of historical sites and attractions. The harbor was the key to Hampton Roads' growth, both on land and in water-related activities and events. While the harbor and its tributaries were (and still are) important transportation conduits, at the same time they presented obstacles to land-based commerce and travel.\nCreating and maintaining adequate infrastructure has long been a major challenge. The Hampton Roads Bridge–Tunnel (HRBT) and the Monitor–Merrimac Memorial Bridge–Tunnel (MMMBT) are major harbor crossings of the Hampton Roads Beltway interstate, which links the large population centers of Hampton Roads. In 2007, the Hampton Roads Transportation Authority (HRTA) was formed under a controversial state law to levy various additional taxes, fees, and tolls to generate funding for major regional transportation projects, including a long-sought but costly third crossing of the harbor of Hampton Roads."}}