{"Hampton": {"Old Point Comfort": "Old Point Comfort is a point of land located in the independent city of Hampton. It lies at the extreme tip of the Virginia Peninsula at the mouth of Hampton Roads in the United States.\n\nAccording to a combination of old records and legend, the name derived from an incident when the Jamestown settlers first arrived. Captain Christopher Newport's flagship, Susan Constant, anchored nearby on 28 April 1607. Members of the crew \"rowed to a point where they found a channel which put them in good comfort. They named the adjacent land Cape Comfort, now known as Old Point Comfort to differentiate it from New Point Comfort 21 miles (34 km) up the Chesapeake Bay.\nPoint Comfort formed the beginning of the boundary of colonial Virginia. The Second Charter of the Virginia Company, granted in 1609, gave the company:\nall those Lands, Countries, and Territories, situate, lying, and being in that Part of America, called Virginia, from the pointe of lande called Cape or Pointe Comfort all alonge the seacoste to the northward two hundred miles and from the said pointe of Cape Comfort all alonge the sea coast to the southward twoe hundred miles; and all that space and circuit of lande lieinge from the sea coaste of the precinct aforesaid upp unto the lande, throughoute, from sea to sea, west and northwest . . .\nBecause of the ambiguity as to which line was to run west, and which northwest, this charter gave the Virginia Company either about 80,000 square miles (210,000 km2) of eastern North America, or about one-third of the entire continent, extending to the Pacific Ocean. The Colony of Virginia chose the larger interpretation, and the Commonwealth of Virginia continued to claim much of the Ohio Valley and beyond until after the American Revolution, relinquishing its claims to the Northwest Territory only in 1784. It allowed its western claims to become the state of Kentucky in 1790. Kentucky was officially admitted as a state on June 1, 1792.\nThe lighthouse was captured by the British during the War of 1812, when the Jack Tars and Royal Marines sailed into the Chesapeake. After their futile attempt to seize the town of Norfolk, the invading British Navy landed at Old Point Comfort and used the lighthouse tower as an observation post. From there they invaded and burned Hampton on June 25, 1813, and then set the capitol in Washington D.C. on fire a month later on August 14.\n\nIn the 19th and first half of the 20th centuries Old Point Comfort served as the terminus and connection point for passenger and express freight ships connecting cities of Chesapeake Bay by both water and rail routes with Boston, New York and along the southeastern coast. Rail lines, for example the New York, Philadelphia and Norfolk Railroad, provided rail car through ferry service from Old Point Comfort to Cape Charles on the Eastern Shore of Virginia for land route connections to points north.\nFor most of the 19th and 20th centuries, Old Point Comfort was a summer and winter resort in the town of Phoebus in Elizabeth City County; in 1952 the residents of both the town and county voted to be consolidated with the independent city of Hampton. Old Point Comfort is the location of historic Fort Monroe, The Chamberlin, and the Old Point Comfort Light.\nOld Point Comfort was the site in 1909 where Southern Baptists and Northern Baptists inaugurated negotiations toward a comity agreement.\nIt was near Old Point Comfort that the USS Missouri (BB-63), then the only U.S. battleship in commission, was proceeding seaward on a training mission from Hampton Roads early on 17 January 1950 when she ran aground 1.6 miles (3.0 km) from Thimble Shoal Light (near Old Point Comfort). She hit shoal water a distance of three ship-lengths from the main channel. Lifted some seven feet above waterline, she stuck hard and fast. With the aid of tugboats, pontoons, and an incoming tide, she was refloated on 1 February 1950 and repaired.\n\n"}}