{"Hampton": {"Battle of Hampton Roads": "The Battle of Hampton Roads, often referred to as either the Battle of the Monitor and Merrimack (or Virginia) or the Battle of Ironclads, was the most noted and arguably most important naval battle of the American Civil War from the standpoint of the development of navies. It was fought over two days, March 8–9, 1862, in Hampton Roads, a roadstead in Virginia where the Elizabeth and Nansemond rivers meet the James River just before it enters Chesapeake Bay adjacent to the city of Norfolk. The battle was a part of the effort of the Confederacy to break the Union blockade, which had cut off Virginia's largest cities, Norfolk and Richmond, from international trade.\nThe major significance of the battle is that it was the first meeting in combat of ironclad warships, i.e., the USS Monitor and the CSS Virginia. The Confederate fleet consisted of the ironclad ram Virginia (built from the remnants of the USS Merrimack) and several supporting vessels. On the first day of battle, they were opposed by several conventional, wooden-hulled ships of the Union Navy. On that day, Virginia was able to destroy two ships of the Federal flotilla, USS Congress and USS Cumberland, and was about to attack a third, USS Minnesota, which had run aground. However, the action was halted by darkness and falling tide, so Virginia retired to take care of her few wounded—which included her captain, Flag Officer Franklin Buchanan—and repair her minimal battle damage.\nDetermined to complete the destruction of Minnesota, Catesby ap Roger Jones, acting as captain in Buchanan's absence, returned the ship to the fray the next morning, March 9. During the night, however, the ironclad Monitor had arrived and had taken a position to defend Minnesota. When Virginia approached, Monitor intercepted her. The two ironclads fought for about three hours, with neither being able to inflict significant damage on the other. The duel ended indecisively, Virginia returning to her home at the Gosport Navy Yard for repairs and strengthening, and Monitor to her station defending Minnesota. The ships did not fight again, and the blockade remained in place.\nThe battle received worldwide attention, and it had immediate effects on navies around the world. The preeminent naval powers, Great Britain and France, halted further construction of wooden-hulled ships, and others followed suit. A new type of warship, monitor, was produced based on the principle of the original. The use of a small number of very heavy guns, mounted so that they could fire in all directions was first demonstrated by Monitor but soon became standard in warships of all types. Shipbuilders also incorporated rams into the designs of warship hulls for the rest of the century."}}