{"Hampton": {"Quarters 17 (Fort Monroe)": "Fort Monroe (also known as the Fort Monroe National Monument) is a decommissioned military installation in Hampton, Virginia—at Old Point Comfort, the southern tip of the Virginia Peninsula, United States. Along with Fort Wool, Fort Monroe guarded the navigation channel between the Chesapeake Bay and Hampton Roads—the natural roadstead at the confluence of the Elizabeth, the Nansemond and the James rivers. Surrounded by a moat, the seven-sided star fort is the largest stone fort ever built in the United States.\nDuring the initial exploration by the mission headed by Captain Christopher Newport in the earliest days of the Colony of Virginia, the site was identified as a strategic defensive location. Beginning by 1609, defensive fortifications were built at Old Point Comfort during Virginia's first two centuries. The first was a wooden stockade named Fort Algernourne. However, the much more substantial facility of stone to become known as Fort Monroe (and adjacent Fort Wool on an artificial island across the channel) were completed in 1834. The principal facility was named in honor of U.S. President James Monroe. Throughout the American Civil War (1861–1865), although most of Virginia became part of the Confederate States of America, Fort Monroe remained in Union hands. It became notable as a historic and symbolic site of early freedom for former slaves under the provisions of contraband policies. For two years thereafter, the former Confederate President, Jefferson Davis, was imprisoned at the fort. His first months of confinement were spent in a cell of the casemate fort walls that is now part of its Casemate Museum. In the 20th century, it housed the Coast Artillery School and later the United States Army Training and Doctrine Command (TRADOC) until its decommission.\nFort Monroe was decommissioned on September 15, 2011, and many of its functions were transferred to nearby Fort Eustis. Several re-use plans for Fort Monroe are under development in the Hampton community. On November 1, 2011, President Barack Obama signed a proclamation to designate portions of Fort Monroe as a National Monument. This was the first time that President Obama exercised his authority under the Antiquities Act, a 1906 law to protect sites deemed to have natural, historical or scientific significance."}}