{"Hampton": {"Hampton, Virginia": "Hampton is an independent city in the Commonwealth of Virginia in the United States. As of the 2010 census, the population was 137,436.\nAs one of the seven major cities that compose the Hampton Roads metropolitan area, it is on the southeastern end of the Virginia Peninsula.\nHampton traces its history to the city's Old Point Comfort, the home of Fort Monroe for almost 400 years, which was named by the 1607 voyagers, led by Captain Christopher Newport, who first established Jamestown as an English colonial settlement. Since consolidation in 1952, Hampton has included the former Elizabeth City County and the incorporated town of Phoebus, consolidating by mutual agreement.\nAfter the end of the American Civil War, historic Hampton University was established opposite from the town on the Hampton River, providing an education for many newly-freed former slaves and for area Native Americans. In the 20th century, the area became the location of Langley Air Force Base, NASA Langley Research Center, and the Virginia Air and Space Center. Hampton features many miles of waterfront and beaches.\nFor residents and visitors alike, the city features a wide array of business and industrial enterprises, retail and residential areas, and historical sites. Most recently, the new Peninsula Town Center development opened in May 2010 on the site of the former Coliseum Mall. Located in the area adjacent to the Hampton Coliseum and the Convention Center, the new urbanism-type project features a wide mix of retail stores, housing and other attractions. Development of new residential development and additional public facilities (such as the new fishing pier recently opened) are underway at Buckroe Beach, long a noted resort area.\nLocated on the Hampton Roads Beltway, it hosts the Hampton Roads Bridge-Tunnel (HRBT) on Interstate 64. First opened in 1957, it was the world's first bridge-tunnel, crossing the mouth of the Hampton Roads harbor, which serves as the gateway to the Chesapeake Bay and the Atlantic Ocean from the eastern United States' largest ice-free harbor and its tributary rivers. Expanded in the 1970s, the HRBT remains Virginia's busiest and deepest such facility."}}