{"Hampton": {"Kecoughtan, Virginia": "Kecoughtan in Virginia was originally named Kikotan (also spelled Kiccowtan, Kikowtan etc.), the name of the Algonquian Native Americans living there when the English colonists arrived in the Hampton Roads area in 1607.\nAccording to William Strachey, Chief Powhatan had slain the weroance at Kecoughtan in 1597, appointing his own young son Pochins as successor there, while resettling some of the tribe at the Piankatank River. Powhatan annihilated the inhabitants at Piankatank in 1608.\nThe Kecoughtan village was where the English explorers received their first welcome in 1607. The tribe remained generally friendly to them until the summer of 1609, when president John Smith sent Captain Martin to forcibly take over the island inhabited by the Nansemonds, across the mouth of the James. A company of 17 men mutinied from Martin and absconded to Kecoughtan to buy corn, where they were all killed. Martin abandoned the Nansemonds' island and returned to Jamestown.\nThe colonists then built Fort Algernon at Old Point Comfort beside their main village in October 1609. After the arrival of Lord Delaware, the English seized the natives' land on July 9, 1610 by luring them out of their village with a tambourine player, then attacking them. The surviving Kecoughtans fled to merge with other Powhatan groups. (See Anglo-Powhatan Wars)\nOn the same date in 1610, the Elizabeth City Parish was founded. The area and the parish has since been continuously occupied. Renamed St. John's Episcopal Church in 1830, the parish is the oldest English-speaking parish in the US today. The current church, constructed in 1728, is the fourth built for the parish.\nKecoughtan became part of Elizabeth River Shire in 1634, and Elizabeth City County in 1637. In the 1690s, Kecoughtan became part of the newly incorporated Town of Hampton, which later became an independent city. Elizabeth City County and its only incorporated town, Phoebus, both agreed to a consolidation with Hampton in 1952, forming the current City of Hampton.\nThrough Fort Algernon and the Kecoughtan settlement, Hampton can claim to be the oldest continually occupied English-speaking settlement in the United States, by virtue of Jamestown (which usually claims this distinction) having been abandoned for two days in June 1610. And, later in 1698, when the capital of the Virginia colony and the parish seat moved to Williamsburg, the buildings at Jamestown, including the church, were abandoned.\nIn an area immediately to the south of the original settlement, many years later, the incorporated town of Kecoughtan was formed on January 1, 1916 and existed in Elizabeth City County 11 years before it was annexed by the independent city of Newport News on January 1, 1927.\n\n"}}