{"Houston": {"Sam Houston Coliseum": "Sam Houston Coliseum was an indoor arena located in Houston, Texas. It was located at 801 Bagby Street near downtown. The arena opened in November 1937 (demolished 1998) and had a capacity of 9,200. It was built in conjunction with the Houston Music Hall, which was adjacent to the Coliseum. The Coliseum and Music Hall complex replaced the Sam Houston Hall, which was a wooden structure that had been erected on the site for the 1928 Democratic National Convention and torn down in 1936.\nIn 1946, permanent ice chillers were installed in the floor to accommodate an ice hockey rink for Houston's first pro ice hockey team – the Houston Skippers of the USHL. The Skippers changed their name the following season to the Houston Huskies and called the Coliseum home until their demise in 1949.\nOn October 14, 1956, Elvis Presley's concert at the Coliseum ended abruptly, as he and his band were taken away by police escort, just before the end of the show as a mob of about 1,000 teenagers rushed the stage, their instruments being destroyed as a result.\nOn November 21, 1963, President John F. Kennedy gave a speech in the Houston Coliseum, on what would be the last night of his life.\nOn August 19, 1965, The Beatles performed at the Coliseum.\nOn July 10, 1968, The Doors performed at the Coliseum with the opening band Moving Sidewalks, featuring Billy Gibbons who would go on to form ZZ Top less than a year later.\nJimi Hendrix played at the venue on June 6, 1970, three months before he died.\nPrior to Hofheinz Pavilion being built, the Houston Cougars played home games at the coliseum.\nThe venue also played host to the Houston Apollos, of the CPHL, from 1965–1969, Houston Mavericks, of the American Basketball Association, from 1967–1969, the Houston Aeros, of the WHA, from 1972–1975 and the Houston Apollos, of the CHL, from 1979–1981. The Aeros moved to The Houston Summit, which opened in November 1975 and played their final 3 seasons there.\nThe Houston Mavericks, a charter member of the American Basketball Association, played their home games in the Coliseum. However, the Houston franchise was plagued by mismanagement and low attendance. In 1969, the team relocated and became the Carolina Cougars. The Mavericks drew less than 500 fans for most games. Their final game in Houston drew 89 fans.\nBy the 1970s, the arena was starting to show its age. Its fate was effectively sealed in 1971, when the NBA's San Diego Rockets moved to Houston and insisted on building a new arena—what became the Summit—as a replacement. When the Rockets arrived, they would not even consider playing in the Coliseum while the Summit was being built, deeming it inadequate even for temporary use and instead playing their first few seasons at Hofheinz Pavilion.\nThe First National Women's Conference, a milestone for the modern women's movement, was held at the Coliseum in November 1977.\nOzzy Osbourne with Randy Rhoads played at the venue on June 7, 1981 and February 17, 1982.\nThe Black Crowes played a free concert at the venue on February 6, 1993. The free show was due to security problems that forced the cancellation of a show during a previous Houston visit. The show was broadcast nationally on radio across North America and also was videotaped for the video \"Bad Luck Blue Eyes Goodbye\". The audio version was released on EPs, dubbed \"High in Houston\". This would be the last concert performed at the Coliseum before being demolished.\nThe Coliseum was also home to Houston Wrestling, run by legendary wrestling promoter, Paul Boesch. Jack Brisco defeated Harley Race to win the National Wrestling Alliance (NWA) world heavyweight professional wrestling championship at the Coliseum on July 20, 1973. It was an event promoted by Boesch.\nSam Houston Coliseum was demolished in 1998. The former site of the Sam Houston Coliseum was redeveloped into the Hobby Center for the Performing Arts, which opened in 2003.\n\n"}}