{"Houston": {"Hobby Center for the Performing Arts": "The Hobby Center for the Performing Arts is a theater in Houston, Texas, US. Opened to the public in 2002, the theater is located downtown on the edge of the Houston Theater District. Hobby Center features 60-foot-high glass walls with views of Houston's skyscrapers, Tranquility Park and Houston City Hall. The Hobby Center is named for former Texas lieutenant governor and Houston businessman, William P. Hobby, Jr., whose family foundation donated the naming gift for the center. The center replaced the former Houston Music Hall and Sam Houston Coliseum.\nBuilt by the general contractor Lyda Swinerton, it was designed by Robert A.M. Stern Architects (RAMSA) and Morris Architects. RAMSA was inspired by legendary theatre designers Herts & Tallant, who practiced in Manhattan during the early twentieth century. The major building materials are limestone, brick, painted steel columns, glazed curtain wall and standing seam metal roof. Two theaters in the center were constructed specifically for theater and musical performances.\nSarofim Hall, a 2,650-seat theater acoustically designed for touring Broadway productions, is home to Theatre Under the Stars. Golden latticework surrounds the hall, while multi-storied, gold-leaf columns contrast with midnight blue walls. The Joe and Lee Jamail Celestial Dome Ceiling features twinkling fiber optic stars that replicate the Texas night sky. The theatre has three tiers: orchestra, mezzanine, and upper gallery.\nZilkha Hall, jewel box 500-seat hall showcases the ensembles of the Uniquely Houston program, the only performing arts series of its kind in the country. The series fosters artistic and administrative growth for smaller and mid-sized performing arts groups in the Houston metropolitan area. They include the Psophonia Dance Company, the Maggini String Orchestra, and Ars Lyrica Houston, to name but three.\nTwo significant works of art were commissioned for the center. American painter Sol LeWitt's mural \"Wall Drawing 2002\" serves as the focal point of the Grand Lobby. British-born sculptor Tony Cragg's two-part bronze \"In Minds\" mimics human profiles outside at Hines Plaza."}}