{"Huntington_Beach": {"USS YMS-328": "USS YMS-328 was a US Navy YMS-1-class (YMS-135 subclass) Yard Mine Sweeper (YMS), built in Ballard, Washington at Ballard Marine & Railway in Ballard, Washington (Seattle). She was classified as a Mark II design and her hull is constructed completely out of 3\" vertical grain Douglas-fir. Sister ships include Jacques Cousteau's RV Calypso. After naval service during World War II, she became a private yacht. Later renamed Wild Goose she is most notable for having been owned by actor John Wayne. The yacht was listed on the US National Register of Historic Places on 19 July 2011.\nYMS-328 was delivered on 26 May 1943. She served in the Aleutian Islands during World War II, sweeping enemy minefields at Attu and US minefields at Kiska, and patrolling out of Adak. She was en route to Dutch Harbor to be fitted for the invasion of Paramishiru Island in Japan, when Japan surrendered. YMS-328 returned to Bremerton, Washington. She was stricken from the Naval Vessel Register in 1946.\nYMS-328 was sold privately in 1948 to Vancouver Tug & Barge owner Harold Jones. He named her La Beverie. Upon Jones's death in 1956, millionaire Max Wyman purchased the yacht and renamed her the Wild Goose II. Wyman traveled the world on the yacht including Tahiti, Bora Bora, and Hawaii. In 1962, she was bought by John Wayne and went through a major renovation. Wayne changed her name to Wild Goose. He kept the ship for the last 17 years of his life. He entertained a who's who of the time including Richard Nixon and Ronald Reagan.\nWild Goose was featured in the 1968 film Skidoo where she was the yacht, named Mother, of a reclusive mob boss named \"God\" played by Groucho Marx. The yacht was used extensively with scenes shot from the exterior and in the wheel house, cabins, engine room, upper and lower decks. This ship was also featured in the 1967 film The President's Analyst, doubling as a Canadian spy ship.\nThe travels of the ship were well documented during Wayne's ownership in the 1993 book On Board with the Duke authored by his former captain Bert Minshall. Minshall was on Wild Goose for 16 years with Wayne. The vessel is still in operation for dinner cruises in Newport Beach, California by Hornblower Cruises."}}