{"Huntington_Beach": {"Cuckoo's Nest (nightclub)": "The Cuckoo's Nest (1976–1981) was a punk rock nightclub that was located at 1714 Placentia Avenue in Costa Mesa, California. There were often confrontations with the punks from the Cuckoo's Nest and the cowboys from Zubie's, which shared a parking lot. The police were constantly harassing the punks. Club owner Jerry Roach fought a number of court cases in an effort to keep the club alive, and in his 1981 film on the subject Urban Struggle he suggested that perhaps this was the first time that the authorities would stamp out a fad. The club was a hub of the punk rock in California. The club is notable as being home to the first slam pit. Jim trash from the crowd invented the slam dance at the Cuckoo's Nest according to American hardcore. the Bands such as The Furys 999 (band), The Ramones, XTC, The Damned, Redd Kross, Black Flag, T.S.O.L., Circle Jerks, the Vandals, Social Distortion, Agent Orange (band), Blondie Chaplin, JFA, David Johansen, uk Squeeze (band), the Adolescents, X (American band), the Go-Go's, The Lords of the New Church, Bad Brains, the Cramps, Iggy Pop, Dead Kennedys, the Dickies, Violent Femmes, Ultravox (with John Foxx), the Motels, the Bangles, the Fabulous Thunderbirds, John Cale, Suicidal Tendencies, Los Lobos, Fear (band), Wall of Voodoo, the Misfits (band), the Knack, the Crowd, The Blasters, 45 Grave, The Weirdos, China White (band), The Minutemen (band), Civil Defense (band), 20/20 (band), Pere Ubu, Suburban Lawns, Subhumans (British band), Magazine (band), The Plimsouls, Rubber City Rebels, Berlin (band), Middle Class (band), all played gigs there. The club was memorialized in the Vandals song \"Pat Brown\", a song about a club goer who actually tried to run the cops into the ground and urban struggle or I want to be a cowboy.....couldn't make it as a punker.\nThe film Urban Struggle documents early slam dancing at the Cuckoo's Nest, and includes performances by Black Flag, T.S.O.L., and the Circle Jerks. The film also goes into the legal battles that surrounded the nightclub and Jerry Roach's defiant effort to \"shove punk rock right up their asses.\" Recently, Jessee Roach designed a series of Cuckoo's Nest tee-shirts.\nWhen demolition crews were preparing to tear down the Cuckoo's Nest building, Roach, who owned the Cuckoo's Nest and turned city efforts to close it into a First Amendment cause, said that as long as the building stood, it would be a reminder of his and the punk-rockers' defeat at the hands of city authorities and the club's outraged neighbors.\n\"I don't have fond memories of losing, of unfairly having my means of making money taken away from me,\" said Roach, who in recent years has traded concert clubs for real-estate and restaurant ventures. \"I still think I was railroaded, but that's the breaks. I don't have any nostalgia for it. I'm kind of glad it's getting torn down. I'd rather have it not be there than be a pizza place.\"\nSome veteran O.C. punk-rockers had similarly unsentimental reactions to the news that their long-ago playpen would be razed. Jim Kaa, guitarist of the Crowd, who performed often at the club, said: \"[A] couple of things stick in mind. [The scene at the Cuckoo's Nest] was crazy; it was young, and the police didn't know what the crazy punks were about. There was a lot of fighting, not just [against] the people at Zubie's but punks against punks. 'The Legend of Pat Brown' epitomizes the entire craziness of that whole era.\"\nJack Grisham, whose band, T.S.O.L., was one of the top-drawing acts of the Cuckoo's Nest era, has fond memories of the old days but no nostalgia for the building. \"It's already wrecked as far as I'm concerned,\" Grisham said. \"It was wrecked the day Zubie's got it.\"\nGrisham also said of the club, \"They'd come out of [Zubie's] drunk, and there'd be fights every night. There's a videotape of me beating up these two cowboy guys, and I was wearing a dress at the time. I was trying to [tick] my dad off for a while, and [wearing a dress] was working good.\"\nAlthough the Cuckoo's Nest was closed and eventually torn down only to be replaced by a plumbing supply shop, the legend continues to live on through the music and now a theatrical feature film has been scheduled for production through Endurance Pictures, and will be directed by York Shackleton, the critically acclaimed writer and director of such films as Kush and Street. \"This story captures the mood and intensity of the punk ritual...and sheds some light on the much maligned and misunderstood punk phenomenon.\" Randy Lewis – L.A. Times\n\nA new documentary, We Were Feared – The Story of the Cuckoo's Nest, directed by Jonathan W.C. Mills and executive produced by York Shackleton, was released in 2012 and is now available on YouTube. Excerpts and trailers from–\"Clockwork Orange County\" –which is a revised version of We Were Feared are on YouTube."}}