{"Huntington_Beach": {"Helme–Worthy Store and Residence": "The Helme–Worthy Store and Residence (also known as the Worthy Building and Residence) is the former M.E. Helme House Furnishing Company and Helme–Worthy residence, a home and attached storefront in Huntington Beach, California. It was listed as a historic structure on the National Register of Historic Places on March 31, 1987.\nConstructed in 1904, the M.E. Helme House Furnishing Company building is adjacent to the 1880s Helme–Worthy residence, both undergoing stabilization and historic preservation. The Helme–Worthy residence was moved 11 miles by mule team by Matthew and Mary Josephine Helme from the rural countryside near 5th and Verano (now Euclid Street) in Santa Ana, California, to its current location in downtown Pacific City, now Huntington Beach, in 1903.\nThe home and business belonged to Matthew E. Helme, one of the founders of Huntington Beach and one of the township's first mayors. Helme was elected to the board of trustees for the City of Huntington Beach (the city council) in 1909, the year the town incorporated, serving until 1917. He served as mayor in 1916. \nAs of 2017, the buildings are still owned by descendants of Matthew E. Helme, who are conducting the historic preservation work. The former M.E. Helme House Furnishing Company is now an antique store, M.E. Helme Antiques, and retains the original business' name on the building.\nThe National Register of Historic Places application describes the significance of the historic place as retaining \"their integrity of location, setting, design, workmanship, materials, feeling and association with Huntington Beach's early settlement period. Although the residence is simple in style, it is the oldest house in town. Both provide the only visual picture of early Huntington Beach and its settlement period.\"\nThe M.E. Helme Furnishing Company and Helme–Worthy residence is one of 122 historic properties and districts listed on the National Register of Historic Places in Orange County, California."}}