{"Huntington_Beach": {"Santa Ana River": "The Santa Ana River is the largest river entirely within Southern California in the United States. It rises in the San Bernardino Mountains and flows for most of its length through San Bernardino and Riverside Counties, before cutting through the northern Santa Ana Mountains via Santa Ana Canyon and flowing southwest through urban Orange County to drain into the Pacific Ocean. The Santa Ana River is 96 miles (154 km) long, and its drainage basin is 2,650 square miles (6,900 km2) in size.\nThe Santa Ana drainage basin has a diversity of terrain, ranging from high peaks of inland mountains in the north and east, to the hot, dry interior and semi-desert basins of the Inland Empire, to the flat coastal plain of Orange County. Although it includes areas of alpine and highland forest, the majority of the watershed consists of arid desert and chaparral environments. Due to low regional rainfall, the river carries only a small flow except during the brief winter season, when it is prone to massive flash floods. The San Jacinto River, which drains the southern half of the watershed, rarely reaches the Santa Ana except in extremely wet years. However, a wide variety of animal and plant communities depend on the riparian zones and remnant wetlands along the Santa Ana River.\nHumans have lived on the Santa Ana River for at least 9,000 years. In the period immediately before and during European colonization, there were four distinct indigenous groups in the area. The river was first seen by Europeans in 1769, when it received its name from members of the Spanish Portola expedition. Because it was one of the only reliable sources of water in a wide region, many large ranchos developed along the river and one of its major tributaries, Santiago Creek. After the area became part of the United States, the economy transitioned to agriculture, before urbanizing in the 20th century. Many cities established during this time including Santa Ana, Riverside and Anaheim derived their names from the river. In order to protect urban areas from the river's flood threat, major channelization and damming projects were undertaken in the 20th century, resulting in the loss of much of the natural river channel."}}