{"Irving": {"AT&T Byron Nelson": "The AT&T Byron Nelson is a golf tournament on the PGA Tour. It is hosted by the Salesmanship Club of 600-member civic organization, and has benefited the Club's nonprofit Momentous Institute since its inception. The tournament is held in May at the Four Seasons Resort and Club Dallas at Las Colinas in Irving, Texas, U.S. It is one of two PGA tournaments held in the Dallas-Fort Worth Metroplex – the only metropolitan area to host two PGA tournaments. The tournament is the leading fundraiser for charity on the PGA Tour and has raised more than $143 million. For much of its history, it was the only PGA Tour stop named after a professional golfer; it remains one of only two such events, along with the Arnold Palmer Invitational. Nelson commonly made an appearance during the tournament. It is organized by the Salesmanship Club of Dallas.\nFor the tournament's first several decades, it was played at a variety of courses in Dallas. Byron Nelson was the tournament's first winner in 1944, when it was played at Lakewood Country Club. The following year it was played at Dallas Country Club, and then in 1946 moved to Brook Hollow Golf Club. For the better part of the next decade the event was not contested, until two iterations of it were held in 1956, both at Preston Hollow Country Club. In 1957 the event moved to Glen Lake Country Club before it began a decade-long relationship with Oak Cliff Country Club from 1958–67. In 1968, fifty years ago, the event was renamed the Byron Nelson Golf Classic and its name, through a series of sponsors, has always subsequently been in conjunction with Nelson's name. That same year the event moved to Preston Trail Golf Club, where it was played through 1982. The event then moved to venues in Irving: Las Colinas Sports Club (1983–85) and TPC at Las Colinas (1986–93).\nBeginning in 1994 the tournament was played at two courses, the Tournament Players Course and the Cottonwood Valley Course, both located at the Four Seasons. Previously only the TPC was used, but since the tournament was played in May (during the height of the North Texas storm season), the weather played havoc with the tournament in some years, causing several delays and shortened tournaments. Therefore, the decision was made to add the Cottonwood course in order to shorten the amount of time needed to complete the first two rounds. The first two rounds were played on both courses (each player played one round on each course); after the cut was determined, the TPC is used exclusively for the final two rounds. However, in 2008 the tournament reverted to using only the TPC course, which was significantly renovated.\nHewlett-Packard (HP) bought the previous title sponsor, Electronic Data Systems (EDS) in mid-2008. The agreement ran through 2014, with AT&T becoming the title sponsor beginning in 2015.\nIn 2018, the tournament will move from the Four Seasons course in Irving to the new Trinity Forest Golf Course in Dallas."}}