{"Killeen": {"Carl R. Darnall Army Medical Center": "The Carl R. Darnall Army Medical Center is located at Fort Hood, Texas. It originally opened in 1965 as the Darnall Army Community Hospital, replacing the World War II era hospital, a long group of one-story buildings connected with covered walkways. It is named in honor of Brig. Gen. Carl Rogers Darnall, MD.\nDarnall was the first of three permanent Army hospitals of the 200-300 bed size to open. Constructed in the latest military design of that time, the original building cost $6 million and was furnished with $6 million of equipment. Ground was broken for the hospital on 5 April 1963, with dedication ceremonies conducted on 16 April 1965.\nBuilt to support a one-division installation of 17,000 troops, the original structure was soon outgrown as Fort Hood expanded to a full-fledged Corps. In order to meet the growing medical needs, a massive addition and reconstruction project began in 1979 and was completed on 13 December 1984. With the completion of the $49.7 million addition/renovation project, Darnall doubled in size. Outpatient clinic space tripled, the number of operating rooms increased from five to six, the number of delivery room from two to four, and a Same-Day-Surgery Center with two smaller operating rooms was added. In addition, the entire interior of the original building was upgraded.\nBy 1984, Darnall supported 39,000 active-duty personnel, 45,000 family members and 88,000 retired personnel and their family members residing in Fort Hood's 175 county support area.\nDarnall now supports the 1st Cavalry Division and a number of the III Corps separate brigades. Overall the hospital supports more than 42,000 active duty personnel and more than 145,000 family members and retirees within a 40-mile (64 km) radius. In 2004 it supported the deployment of the Texas National Guard and then its redeployment in December 2005. Since early 2003, more than 2,200 wounded and ill Soldiers evacuated from Iraq and Afghanistan have passed through Darnall, the highest total nationally for an Army hospital and third highest facility in the country behind Walter Reed and Eisenhower medical centers.\nAn average seven births a day are delivered at Darnall. Also on an average day, the staff handle 3,867 out patient visits, 26 surgeries, 31 admissions, 170 Emergency Room visits and fill 5,000 prescriptions.\nOn 1 May 2006, the hospital was officially redesignated as Carl R. Darnall Army Medical Center. In early 2006, it was announced that the new Fort Hood master plan contained a 40-acre (160,000 m2) site near the Clear Creek Post Exchange for a new medical facility. Ground was broken for a new facility to be located just south of the current hospital on December 6, 2010. The new facility opened in 2016.\n\n"}}