{"Lincoln": {"Nebraska Innovation Campus": "The Nebraska Innovation Campus is a public/private research campus being developed by the University of Nebraska–Lincoln. It is located in Lincoln, Nebraska on the 249-acre (1.01 km2) site of the old Nebraska State Fair grounds.\nIts purpose is \"To encourage and incent the greatest amount of private/public research and economic development on this property thus allowing this site to become a preferred location for significant job creation in Lincoln and the State of Nebraska.\"\nThe project is managed by the Nebraska Innovation Campus Development Corporation and is overseen by a nine-member board of directors appointed by the University Regents. The first projects will be related to agriculture and natural resources.\nThe project was made possible by a 2008 state law which moved the Nebraska State Fair to Grand Island and turned the old state fairgrounds over to the university. Several citizens filed a legal challenge to the law, contending that it \"created a special benefit\" for some of the groups and people involved in the plan. However, in May 2010 the Nebraska Supreme Court rejected those arguments and upheld an earlier dismissal of the lawsuit. There was also an attempt to overturn the state law by referendum, but the petition drive failed to get enough signatures to qualify for the ballot.\nAll of the State Fair buildings are to be demolished except the Arsenal and 4-H buildings, which will be remodeled and transformed into a focal point for the research campus. A group of activists is trying to save the 97-year-old Industrial Arts Building from the wrecking ball, and the Regents gave them until July 2010 to find a way to renovate and keep the building. One Wisconsin company submitted a bid to restore and renovate the building, but the university rejected it in August 2010 as too expensive. Later, the university approved a plan to repurpose the Industrial Arts Building, which included the addition of greenhouse space on the second floor."}}