{"Lincoln": {"Lincoln North Star High School": "Lincoln North Star High School (LNS or North Star) is a public secondary school located in Lincoln, Nebraska, United States. It opened its doors in 2003 to 1,150 students, and currently has approximately 2000 students. It remains the newest high school in Lincoln. It is modeled the same as Lincoln Southwest High School. North Star, along with Papillion-La Vista South High School and Elkhorn South High School (both in the Omaha Metro area), are the three newest high schools in the state of Nebraska, with LNS and PLS opening in 2003 and ES opening in 2010. It is currently the largest high school in Lincoln.\nNorth Star operates on a traditional seven-period day schedule, sometimes with eight periods for those who choose it. The school features a system of academies to assist students with post-secondary planning. The means to implement the academies was provided through federal and local grants. Students may participate in the Science and Engineering Academy, Business and Information Technology Academy, Law and Global Affairs Academy, Health and Biotechnology Academy, and Arts and Communications Academy. Additionally, all freshmen are placed in a separate academy designed to help them transition to high school. North Star was the first Lincoln high school to use this innovative system, which has since been expanded to the other five Lincoln public high schools in the form of Professional Learning Communities.\nNorth Star was originally supposed to be named Lincoln Northwest; every high school in Lincoln is named after a direction depending on where they are located, with the exception of Lincoln High. Before the school opened, the students voted on the name North Star due to the school's location and the positive symbolism and uniqueness of the name. North Star rivals Lincoln High as the most diverse school in Lincoln, Nebraska.\nThe school's colors are navy blue and burgundy/maroon. Although the official mascot is the North Star Navigator, its mascot is an alligator, nicknamed \"Al Gator\". Most students seemed to prefer the alligator mascot, and as a result, most locals now refer to the students and interscholastic teams as the Gators."}}