{"Lincoln": {"Zoo Bar (Lincoln, Nebraska)": "The Zoo Bar is a blues music venue and nightclub located in downtown Lincoln, Nebraska, on 136 North 14th Street. Styled around the Chicago blues clubs, it is a long, narrow venue in a building built in 1921.\nAround 1971, Jim Ludwig, Bill Kennedy, and Don Chamberlin purchased the bar. Larry Boehmer, a Master of Fine Arts student at the University of Nebraska, Lincoln at the time, promoted the bar to his fellow artists. He booked the first band in 1973 and was sole owner by 1977.\nBoehmer met Chicago musician and promoter Bob Riedy and formed a connection that brought many revered Chicago artists to the Lincoln club. Because of this connection, the Zoo Bar was the first white club that Magic Slim ever played. In 1975 he had never ventured outside the clubs in Chicago's African-American neighborhoods.\nIn 1977, Boehmer was the sole owner and the Zoo was established as an important stop for bands on the touring circuit. The first band Boehmer booked to play in the club was The Cotton Blues Band in the summer of 1973. The first national act to play at the bar was Luther Allison in September 1974.\nMusical acts have included: Bernard Allison, Luther Allison, Dave Alvin, Billy Bacon and the Forbidden Pigs, Tab Benoit, Tommy Castro, Albert Collins, Robert Cray, Deke Dickerson, Bo Diddley, Chris Duarte, Lil Ed and the Blues Imperials, Tinsley Ellis, Rick Estrin, Anson Funderburgh, Buddy Guy, the Hacienda Brothers, John Hammond, The Belairs, James Harman, Mark Hummel, Candye Kane, Jay McShann, Matt \"Guitar\" Murphy, Charlie Musselwhite, Rod Piazza, Ana Popovic, Otis Rush, Doug Sahm, Curtis Salgado, Gina Sicilia, Magic Slim, Watermelon Slim, Son Seals, Koko Taylor, Junior Wells, Kim Wilson, and Link Wray. Eddie Clearwater, Mighty Joe Young, Clarence Gatemouth Brown, Carey Bell\nNumerous live albums have been recorded in the club.\nMagic Slim and his band were regular performers at the bar, playing week-long stints. In the 1990s, Magic Slim moved his family from Chicago to Lincoln.\nIn 1993 the Zoo Bar won the Blues Foundation's Keeping the Blues Alive Award for Club of the Year.\nJames Harman wrote a song on behalf of the club called \"Everybody's Rockin' (At The Zoo Bar)\", which can be found on Harman's 1995 Black And White CD.\nIn 2000 Larry Boehmer retired and passed the bar on to his sons, Jeff and Tim Boehmer, and Pete Watters; Jeff and Pete are partners in the club now. On September 4, 2012, Larry Boehmer died after struggling with lung cancer. Many not only remember Larry as a visual artist and blues player, but as a community builder.\nIn July 2013, the bar celebrated its 40th anniversary.\n\n"}}