{"Lincoln": {"Lincoln, Nebraska": "Lincoln (pronounced ) is the capital of the U.S. state of Nebraska and the county seat of Lancaster County. The city covers 93.46 square miles (242.06 km2) with a population of 280,364 in 2016. It is the second-most populous city in Nebraska and the 71st-largest in the United States. The city is the economic and cultural anchor of a substantially larger metropolitan area in the southeastern part of the state called the Lincoln Metropolitan and Lincoln-Beatrice Combined Statistical Areas. The statistical area is home to 348,720 people, making it the 105th-largest combined statistical area in the United States.\nThe city was founded in 1856 as the village of Lancaster on the wild salt marshes of what was to become Lancaster County. In 1867, the village of Lancaster became Nebraska's state capital and was renamed Lincoln. The Bertram G. Goodhue designed state capitol building was completed in 1932 and is the second tallest capitol in the United States. As the city is the seat of government for the state of Nebraska, the state and the United States government are major employers. The University of Nebraska was founded in Lincoln in 1867. The university is the largest in Nebraska with 26,079 students enrolled and is the city's third-largest employer. Other primary employers fall within the service and manufacturing industries, including a growing high-tech sector. The region makes up a part of what is known as the greater Midwest Silicon Prairie.\nDesignated as a \"refugee-friendly\" city by the U.S. Department of State in the 1970s, the city was the twelfth-largest resettlement site per capita in the United States by 2000. Refugee Vietnamese, Karen (Burmese ethnic minority), Sudanese and Yazidi (Iraqi ethnic minority) people, as well as refugees from the Middle East, have been resettled in the city. Lincoln Public Schools during the school year of 2017–18 provided support for approximately 3,100 students from 100 countries, who spoke 50 different languages."}}