{"Lincoln": {"Nebraska State Penitentiary": "The Nebraska State Penitentiary (NSP) is a state correctional facility for the Nebraska Department of Correctional Services. Located in Lincoln, it is the oldest state correctional facility in Nebraska, opening in 1869. Until after World War I, it was the only adult correctional facility in the state.\nDuring 1980-1981, the existing cellblocks constructed during the second half of the 19th century were replaced by four (later five) modular housing units. A new administrative complex and an EPA-approved multi-fuel power plant were also completed at the same time. An existing dormitory building constructed in the 1950s was retained as a medium security facility and two new 100 bed dormitory units were opened in 1998. A thirty-six bed control unit also built in the 1950s continues in use as a high security segregation facility. The Industries Plant, Laundry and other support buildings were retained from the older facility as well.\nThe inmate population at the NSP typically consists of offenders aged 21 years and above, serving medium to longer sentences. The Nebraska State Penitentiary uses the Unit Management concept designed to improve control and staff/inmate relationships by dividing the larger institution population into smaller, more manageable groups and to improve and personalize the delivery of rehabilitative services.\nThe NSP has been accredited by the American Correctional Association since 1985.\nThe NSP offers a variety of education/rehabilitation programs designed to enhance an inmate's chances for successful community adjustment upon release. These include Educational/Life Skills and Vocational Programs, Self-Improvement (Mental Health and Control Unit Program), (Residential and Non-residential Substance Abuse Treatment), Residential Treatment Community (RTC), Religious Programming and Self-Betterment Activities), and Support Services\nThe NSP is the site of major components of the Agency's Cornhusker State Industries (CSI) program.\nSecurity Levels: Maximum, Medium and Minimum Custody.\nAverage Population: 1323\nNumber of Staff: 465\nCost per Inmate per Year: $27,834"}}