{"New_York": {"Postmasters Gallery": "Postmasters is a contemporary art gallery located in Manhattan's Tribeca neighborhood, owned and directed by Magda Sawon and Tamas Banovich. The gallery opened in the East Village in December 1984, moved to SoHo in 1989, and relocated to Chelsea in September 1998 and in June 2013 Postmasters moved to 54 Franklin Street in Tribeca, taking over a 4,500-square-foot (420 m2) ground-floor space complete with large functional basement.\nThe gallery has a history of exhibiting work in media that is challenging for a commercial art gallery, including the work of several Net.artists and political activists. For example, Maciej Wisniewski's media-rich e-mail software Netomat was exhibited as an artwork at the gallery in 1999 before being exhibited at the Whitney Museum of Art in 2000. The gallery's decision to exhibit software as an art form engages the Marshall McLuhan-coined concept \"The medium is the message\" by updating it with Wisnieski's belief that 'the artist's role is to challenge the existing notion of software development and distribution.' And in May 2010, Chatroulette became both medium and subject for artists Eva and Franco Mattes AKA 0100101110101101.ORG.\nOn September 6, 2001, German-born artist Wolfgang Staehle, installed three live-feed video projections in the gallery, one of which was a panoramic view of Lower Manhattan, which would remain on view for the rest of the month. In a strange coincidence, the feed captured the terrorist attacks of September 11th, transforming a fixed image of the city into what the art critic Roberta Smith of the New York Times called \"a live history painting.\" In 2007, Hong Kong-based artist and Internet activist Kenneth Tin-Kin Hung exhibited a video critical of the George W. Bush Administration entitled \"Because Washington Is Hollywood for Ugly People\".\nOn occasion, Sawon has allowed artists to direct the public's attention to her own role as an art dealer. In 1992 the gallery hosted an exhibition of work by Silvia Kolbowski that featured posters of the gallery itself. In an event called \"Ask the Dealer,\" during the month-long hashtagclass series at Winkleman Gallery in 2010, Sawon promised to truthfully answer any question asked of her regarding her experience as a gallerist."}}