{"New_York": {"Horace Greeley (Ward)": "Horace Greeley (February 3, 1811 – November 29, 1872) was founder and editor of the New-York Tribune, among the great newspapers of its time. Long active in politics, he served briefly as a congressman from New York, and was the unsuccessful candidate of the new Liberal Republican party in the 1872 presidential election against incumbent President Ulysses S. Grant.\nGreeley was born to a poor family in Amherst, New Hampshire. He was apprenticed to a printer in Vermont and went to New York City in 1831 to seek his fortune. He wrote for or edited several publications and involved himself in Whig Party politics, taking a significant part in William Henry Harrison's successful 1840 presidential campaign. The following year, he founded the Tribune, which became the highest-circulating newspaper in the country through weekly editions sent by mail. Among many other issues, he urged the settlement of the American West, which he saw as a land of opportunity for the young and the unemployed. He popularized the phrase \"Go West, young man, and grow up with the country,\" although it is uncertain whether it originated with him.\nGreeley's alliance with William H. Seward and Thurlow Weed led to him serving three months in the House of Representatives, where he angered many by investigating Congress in his newspaper. In 1854, he helped found and may have named the Republican Party. Republican newspapers across the nation regularly reprinted his editorials. During the Civil War, he mostly supported Lincoln, though urging him to commit to the end of slavery before the President was willing to do so. After Lincoln's assassination, he supported the Radical Republicans in opposition to President Andrew Johnson. He broke with Republican president Ulysses Grant because of corruption and Greeley's sense that Reconstruction policies were no longer needed.\nGreeley was the new Liberal Republican Party's candidate in the 1872 U.S. presidential election. He lost in a landslide, despite having the additional support of the Democratic Party. He was devastated by the death of his wife, who died five days before the election, and died himself three weeks later, before the electoral college had met."}}