{"New_York": {"Cortlandt Street (IRT Broadway–Seventh Avenue Line)": "The IRT Broadway–Seventh Avenue Line (also known as the Seventh Avenue Line or the West Side Line) is a New York City Subway line. It is one of several lines that serves the A Division (IRT), stretching from South Ferry in Lower Manhattan north to Van Cortlandt Park–242nd Street in Riverdale, Bronx. The Brooklyn Branch, known as the Wall and William Streets Branch during construction, from the main line at Chambers Street southeast through the Clark Street Tunnel to Borough Hall in Downtown Brooklyn, is also part of the Broadway–Seventh Avenue Line.\nThe line was constructed in two main portions by the Interborough Rapid Transit Company, a private operator. The first portion, north of 42nd Street, was opened between 1904 and 1908, and is part of the first subway line in the city. The line ran from City Hall, up the Lexington Avenue Line, across 42nd Street, and up Seventh Avenue and Broadway, before splitting into the Broadway Branch and the Lenox Avenue Line. The second portion of the line, that south of 42nd Street, was constructed as part of the Dual Contracts, which were signed between the IRT, the New York Municipal Railway (a subsidiary of the Brooklyn Rapid Transit Company), and the City of New York. Among the various subway lines that were to be constructed as part of the contracts, the West Side Line was to be extended south along Seventh Avenue to serve Manhattan's West Side.\nThis extension extended service to the end of Lower Manhattan and into Brooklyn, relieving crowding on the East Side Line, while opening up service to new areas. The Pennsylvania Railroad's new hub in Manhattan, Penn Station, could now be accessed by the subway. Additionally, Manhattan's West Side was rebuilt with the arrival of the line. To allow the wide four-track line to go through the area, new streets had to be mapped and built, and new buildings were constructed as a result. And finally, capacity on the IRT's subway system doubled, increasing its usage.\nSince the line opened, service patterns have been streamlined. Originally, express and local trains ran to both the Broadway Branch and to the Lenox Avenue Line, resulting in delays. As part of a rebuilding of the line in the late 1950s, all local trains were sent up the Broadway Branch, and all express trains were sent up the Lenox Avenue Line. Accompanying these changes were the lengthening of platforms, new subway cars, and the closing of the 91st Street station. One other major change in service was the implementation of skip-stop service on the 1 and 9 trains in 1989. 1 and 9 trains alternated skipping certain stops with the intent of saving travel times for people in the Bronx and Upper Manhattan. However, this was discontinued in 2005 as few people benefited.\nTwo major projects are being undertaken on the southern portion of the line: the rebuilding of the Cortlandt Street station, and the rebuilding of the new South Ferry terminal. Following the September 11 attacks, the Cortlandt Street station was destroyed, and as a result, is being completely rebuilt with a new connection to the World Trade Center PATH station. In 2009, a new station at South Ferry opened to replace the old South Ferry loop station. The new station, a two-terminal, was intended to increase capacity and to save travel times. However, just three years later it closed as a result of Hurricane Sandy, which completely flooded the station. The loop station was temporarily open to serve the area, but it closed in June 2017 when the newer station reopened."}}