{"New_York": {"Temple Court Building and Annex": "The Temple Court Building and Annex, at 5 Beekman Street (corner of Nassau street), New York City, reopened in August 2016 as the Beekman Hotel following extensive renovations.\nThe structure was designed as a red-brick and terra-cotta office building in the Queen Anne, neo-Grec, and Renaissance Revival styles. The original structure was begun in 1881 and finished in 1883, with an attached annex constructed between 1889 and 1890. It was commissioned and originally owned by Eugene Kelly (1808–1894), an Irish immigrant who had achieved wealth as a dry-goods retailer and banker. The firm of Benjamin Silliman, Jr. and James M. Farnsworth were the architects.\n\nThe building’s most noteworthy feature is the atrium rising through all nine stories and crowned by a large pyramidal skylight. In the 1940s, walls were erected on each floor to enclose this court for fire-safety reasons, hiding the atrium, railings, and skylight from public view. Those walls have since been removed, revealing the skylight and the atrium with its elaborate wrought-iron railings.\nTemple Court was purportedly \"modeled after a building of the same name in London\" that was part of the Inns of Court. It was intended to attract lawyers as tenants, although a 1942 article says that by then the lawyers had moved out because of the declining neighborhood.\nThe adjoining annex, built between 1889 and 1890 at 119-121 Nassau Street, was designed by James M. Farnsworth, who had already established his own practice separate from his partnership with Silliman. The annex has a limestone facade in a Romanesque Revival style.\nOn April 2, 1893, between 6:30 and 7:30 am, a fire started in room 725 of the annex, a typist’s office. No one was in the building, except for a resident janitor and his wife, who lived on the annex's tenth floor and were able to escape. While there was no loss of life, the damage to the top four floors of the annex was severe. Interior pine walls fueled the blaze, but the structure of the building survived.\nThe Temple Court Building with its Annex was designated a New York City landmark on November 10, 1998.\nThe building’s final tenant was architect Joseph Pell Lombardi, who moved out in 2001, leaving the entire structure vacant. In 2008, Joseph Chetrit and Charles Dayan purchased the building for $61 million and planned to convert it into a 200-room hotel. In 2012, after a dispute between Chetrit and Dayan, it was sold to GFI Capital Resources. In August 2016, the building re-opened as The Beekman, consisting of a combination of condominiums and hotel rooms."}}