{"New_York": {"Samuel Osgood House": "The Samuel Osgood House (demolished in 1856), also known as the Walter Franklin House, was an eighteenth-century mansion at the northeast corner of Pearl and Cherry Streets in Manhattan. It served as the first Presidential Mansion, housing George Washington, his family, and household staff, from April 23, 1789, to February 23, 1790, during New York City's two-year term as the national capital.\nThe owner, Samuel Osgood, was a Massachusetts politician and lawyer, who settled in New York City. He married Maria Bowne Franklin, widow of Walter Franklin, the merchant who had built the house in 1770. Congress rented it for Washington's use, and the President-Elect moved in a week before his April 30, 1789, inauguration as first President of the United States. In addition to living quarters, the Osgood House contained the President's private office (the equivalent of the Oval Office) and the public business office (the equivalent of the West Wing), making it the first seat of the executive branch of the federal government.\nThe Samuel Osgood Papers, at the New York Historical Society, list purchases made to prepare the mansion for Washington occupancy.\n\n\"I went the morning before the General's arrival to look at it. The best of furniture in every room, and the greatest quantity of plate and china I ever saw; the whole of the first and second stories is papered and the floors covered with the richest kinds of Turkey and Wilton carpets. There is scarcely anything talked about now but General Washington and the Palace.\"\n\nSteward Samuel Fraunces, former owner of nearby Fraunces Tavern, managed a household staff of about 20: wage workers, indentured servants, and enslaved servants. Slavery was legal in New York, and Washington brought seven enslaved Africans from Mount Vernon to work in his presidential household: William Lee, Christopher Sheels, Giles, Paris, Austin, Moll, and Oney Judge.\nTwo of Martha Washington's grandchildren were part of the First Family: Nelly Custis (b. 1779) and \"Wash\" Custis (b. 1781).\nSoon after his inauguration, Washington became seriously ill with a tumor on his thigh (possibly caused by anthrax poisoning). Cherry Street was cordoned off to prevent his being disturbed.\nThe house was rented for one year at an annual rent of $845, but the president vacated it after ten months when a larger residence became available. Washington moved to the Alexander Macomb House at 39–41 Broadway, which he occupied from February 23 to August 30, 1790.\nUnder the July 1790 Residence Act, the national capital moved to Philadelphia, Pennsylvania, for a 10-year period, while the permanent national capital was under construction in the District of Columbia.\nThe Osgood House was demolished in 1856. A bronze plaque where Pearl Street crosses under the Brooklyn Bridge approach marks its location.\n\n"}}