{"New_York": {"World Trade Center (1973–2001)": "The original World Trade Center was a large complex of seven buildings in Lower Manhattan, New York City, United States. It featured the landmark Twin Towers, which opened on April 4, 1973, and were destroyed in 2001 during the September 11 attacks. At the time of their completion, the Twin Towers—the original 1 World Trade Center, at 1,368 feet (417 m); and 2 World Trade Center, at 1,362 feet (415.1 m)—were the tallest buildings in the world. Other buildings in the complex included the Marriott World Trade Center (3 WTC), 4 WTC, 5 WTC, 6 WTC, and 7 WTC. All were built between 1975 and 1985, with a cost of $400 million (equivalent to $1.86 billion in 2016). The complex was located in New York City's Financial District and contained 13,400,000 square feet (1,240,000 m2) of office space.\nThe World Trade Center experienced a fire on February 13, 1975, a bombing on February 26, 1993, and a bank robbery on January 14, 1998. In 1998, the Port Authority decided to privatize the World Trade Center, leasing the buildings to a private company to manage, and awarded the lease to Silverstein Properties in July 2001.\nOn the morning of September 11, 2001, Al-Qaeda-affiliated hijackers flew two Boeing 767 jets into the North and South Towers within minutes of each other; two hours later, both had collapsed. The attacks killed 2,606 people in and within the vicinity of the towers, as well as all 157 on board the two aircraft. Falling debris from the towers, combined with fires that the debris initiated in several surrounding buildings, led to the partial or complete collapse of all the buildings in the complex and caused catastrophic damage to ten other large structures in the surrounding area. The cleanup and recovery process at the World Trade Center site took eight months, during which the remains of the other buildings were demolished.\nThe World Trade Center complex was rebuilt over more than a decade. The site is being rebuilt with six new skyscrapers, while a memorial to those killed in the attacks and a new rapid transit hub have both opened. One World Trade Center, the tallest building in the United States, is the lead building for the new complex, reaching more than 100 stories on completion in November 2014."}}