{"New_York": {"Collapse of the World Trade Center": "The Twin Towers of the World Trade Center (WTC) collapsed on September 11, 2001, as a result of being struck by two jet airliners hijacked by 10 terrorists affiliated with al-Qaeda, during the September 11 attacks. Two of the four hijacked airliners crashed into the Twin Towers, one into the North Tower (WTC 1) and the other into the South Tower (WTC 2). The collapse of the Twin Towers destroyed the rest of the complex, and debris from the collapsing towers severely damaged or destroyed more than a dozen other adjacent and nearby structures. The South Tower collapsed at 9:59 am, less than an hour after being hit by the second hijacked airliner, and at 10:28 am the North Tower collapsed. Later that day, WTC 7 collapsed at 5:21 pm from fires that had started when the North Tower collapsed. As a result of the attacks to the towers, a total of 2,763 people died. Of the people who died in the towers, 2,192 were civilians, 343 were firefighters, and 71 law enforcement officers. Aboard the two airplanes, 147 civilians and 10 hijackers also died.\nImmediately following the attacks, a building performance study (BPS) team of engineering specialists was formed by the Structural Engineering Institute of the American Society of Civil Engineers (SEI/ASCE) and Federal Emergency Management Agency (FEMA). The BPS team issued its report in May 2002, finding that the aircraft impacts caused \"extensive structural damage, including localized collapse\" and that the resulting fires \"further weakened the steel-framed structures, eventually leading to total collapse\". They also presented recommendations for more detailed engineering studies of the disaster.\nThe BPS team investigation was later followed by a more detailed investigation conducted by the National Institute of Standards and Technology (NIST), which also consulted outside engineering entities. This investigation was completed in September 2005. The NIST investigators did not find anything substandard in the design of the WTC towers, noting that the severity of the attacks and the magnitude of the destruction was beyond anything experienced in U.S. cities in the past. They also emphasized the role of the fires and found that sagging floors pulled inward on the perimeter columns: \"This led to the inward bowing of the perimeter columns and failure of the south face of WTC 1 and the east face of WTC 2, initiating the collapse of each of the towers.\"\nThe cleanup of the WTC site involved round-the-clock operations, many contractors and subcontractors, and cost hundreds of millions of dollars. The demolition of the surrounding damaged buildings continued even as new construction proceeded on the Twin Towers' replacement, One World Trade Center, which was opened in November 2014. As of January 2018, five new buildings had been erected on the site; the last one, Two World Trade Center, is scheduled for completion in 2022."}}