{"New_York": {"National September 11 Memorial & Museum": "The National September 11 Memorial & Museum (also known as the 9/11 Memorial & Museum) is a memorial and museum in New York City commemorating the September 11, 2001 attacks, which killed 2,977 people, and the 1993 World Trade Center bombing, which killed six. The memorial is located at the World Trade Center site, the former location of the Twin Towers that were destroyed during the September 11 attacks. It is operated by a non-profit institution whose mission is to raise funds for, program, and operate the memorial and museum at the World Trade Center site.\nA memorial was planned in the immediate aftermath of the attacks and destruction of the World Trade Center for the victims and those involved in rescue and recovery operations. The winner of the World Trade Center Site Memorial Competition was Israeli architect Michael Arad of Handel Architects, a New York- and San Francisco-based firm. Arad worked with landscape-architecture firm Peter Walker and Partners on the design, creating a forest of swamp white oak trees with two square reflecting pools in the center marking where the Twin Towers stood. In August 2006, the World Trade Center Memorial Foundation and the Port Authority of New York and New Jersey began heavy construction on the memorial and museum. The design is consistent with the original master plan by Daniel Libeskind, which called for the memorial to be 30 feet (9.1 m) below street level—originally 70 feet (21 m)—in a plaza, and was the only finalist to disregard Libeskind's requirement that the buildings overhang the footprints of the Twin Towers. The World Trade Center Memorial Foundation was renamed the National September 11 Memorial & Museum in 2007.\nA dedication ceremony commemorating the tenth anniversary of the attacks was held at the memorial on September 11, 2011, and it opened to the public the following day. The museum was dedicated on May 15, 2014, with remarks from Michael Bloomberg and President Barack Obama. The museum opened to the public on May 21."}}