{"New_York": {"American Airlines Flight 11": "American Airlines Flight 11 was a domestic passenger flight that was hijacked by five al-Qaeda members on September 11, 2001, as part of the September 11 attacks. Mohamed Atta deliberately crashed the plane into the North Tower of the World Trade Center in New York City, killing all 92 people aboard and an unknown number in the building's impact zone. The aircraft involved, a Boeing 767-223ER, registration N334AA, was flying American Airlines' daily scheduled morning transcontinental service from Logan International Airport, in Boston, Massachusetts, to Los Angeles International Airport, in Los Angeles, California.\nFifteen minutes into the flight, the hijackers injured at least three people (possibly killing one), forcibly breached the cockpit, and overpowered the captain and first officer. Atta, an al-Qaeda member and licensed commercial pilot, took over the controls. Air-traffic controllers noticed the flight was in distress when the crew was no longer responding. They realized the flight had been hijacked when Mohamed Atta's announcements for passengers were transmitted to air traffic control. On board, flight attendants Amy Sweeney and Betty Ong contacted American Airlines, and provided information about the hijackers and injuries to passengers and crew.\nThe aircraft crashed into the North Tower of the World Trade Center at 08:46:40 local time. Countless people in the streets of New York City witnessed the strike, but few video recordings captured the moment. Documentary film maker Jules Naudet captured the only known footage of the initial impact from start to finish. Before the hijacking was confirmed, news agencies began to report on the incident and speculated that the crash had been an accident. The impact and subsequent fire caused the North Tower to collapse 102 minutes after the crash, resulting in hundreds of additional casualties. During the recovery effort at the World Trade Center site, workers recovered and identified dozens of remains from Flight 11 victims, but many body fragments could not be identified."}}