{"New_York": {"African Burial Ground National Monument": "African Burial Ground National Monument is a monument at Duane Street and African Burial Ground Way (Elk Street) in the Civic Center section of Lower Manhattan, New York City. Its main building is the Ted Weiss Federal Building at 290 Broadway. The site contains the remains of more than 419 Africans buried during the late 17th and 18th centuries in a portion of what was the largest colonial-era cemetery for people of African descent, some free, most enslaved. Historians estimate there may have been 10,000–20,000 burials in what was called the \"Negroes Burial Ground\" in the 1700s. The five to six acre site's excavation and study was called \"the most important historic urban archeological project in the United States.\" The Burial Ground site is New York's earliest known African-American \"cemetery\"; studies show an estimated 15,000 African American people were buried here.\nThe discovery highlighted the forgotten history of African slaves in colonial and federal New York City, who were integral to its development. By the American Revolutionary War, they constituted nearly a quarter of the population in the city. New York had the second-largest number of slaves in the nation after Charleston, South Carolina. Scholars and African-American civic activists joined to publicize the importance of the site and lobby for its preservation. The site was designated a National Historic Landmark in 1993 and a National Monument in 2006 by President George W. Bush.\nIn 2003 Congress appropriated funds for a memorial at the site and directed redesign of the federal courthouse to allow for this. A design competition attracted more than 60 proposals for a design. The memorial was dedicated in 2007 to commemorate the role of Africans and African Americans in colonial and federal New York City, and in United States history. Several pieces of public art were also commissioned for the site. A visitor center opened in 2010 to provide interpretation of the site and African-American history in New York."}}