{"New_York": {"7 World Trade Center": "7 World Trade Center (7 WTC) refers to two buildings that have existed at the same location within the World Trade Center site in Lower Manhattan, New York City. The current structure is the second building to bear that name and address in the World Trade Center complex. The original structure, part of the original World Trade Center, was completed in 1987 and was destroyed in the September 11 attacks. The current building opened in May 2006. Both buildings were developed by Larry Silverstein, who holds a ground lease for the site from the Port Authority of New York and New Jersey.\nThe original 7 World Trade Center was 47 stories tall, clad in red masonry, and occupied a trapezoidal footprint. An elevated walkway connected the building to the World Trade Center plaza. The building was situated above a Consolidated Edison power substation, which imposed unique structural design constraints. When the building opened in 1987, Silverstein had difficulties attracting tenants. Salomon Brothers signed a long-term lease in 1988, and became the main tenants of the building. On September 11, 2001, 7 WTC was damaged by debris when the nearby North Tower of the World Trade Center collapsed. The debris also ignited fires, which continued to burn throughout the afternoon on lower floors of the building. The building's internal fire suppression system lacked water pressure to fight the fires, and the building collapsed completely at 5:21:10 pm, according to FEMA, while the 2008 NIST study placed the final collapse time at 5:20:52 pm. The collapse began when a critical internal column buckled and triggered structural failure throughout, which was first visible from the exterior with the crumbling of a rooftop penthouse structure at 5:20:33 pm. The collapse made the old 7 World Trade Center the first tall building known to have collapsed primarily due to uncontrolled fires, and the only steel skyscraper in the world to have collapsed due to fire.\nConstruction of the new 7 World Trade Center began in 2002, and was completed in 2006. The building is 52 stories tall (plus one underground floor), making it the 28th-tallest in New York. It is built on a smaller footprint than the original, allowing Greenwich Street to be restored from Tribeca through the World Trade Center site and south to Battery Park. The new building is bounded by Greenwich, Vesey, Washington, and Barclay streets. A small park across Greenwich Street occupies space that was part of the original building's footprint. The current building's design emphasizes safety, with a reinforced concrete core, wider stairways, and thicker fireproofing of steel columns. It also incorporates numerous green design features. The building was the first commercial office building in New York City to receive the U.S. Green Building Council's Leadership in Energy and Environmental Design (LEED) certification, where it won a gold rating. It was also one of the first projects accepted to be part of the Council's pilot program for Leadership in Energy and Environmental Design – Core and Shell Development (LEED-CS)."}}