{"Phoenix": {"Chase Tower (Phoenix)": "The Chase Tower (formerly known as Valley Center and Bank One Center) in Phoenix, Arizona, is the tallest building in the state of Arizona. Built in 1972, it is 483 feet (147 m) tall. It was originally built for local financial heavyweight Valley National Bank, which Bank One merged with in 1993. Bank One merged with Chase in 2005, and the building was renamed in December 2005. It is 40 stories tall, but the highest occupiable floor is the 38th. There is no longer a public observation area on the 39th floor in the Chase Tower; it was closed during redevelopment and construction on the upper floors.\nThe tower takes up an entire city block. The footprint is similar to a 3 leaf clover and its stem. The stem is the narrow elevator core on the southern facade. It has a rough, concrete texture and is the tallest portion of the tower. The remaining exterior is a glass panel curtain wall. The west leaf, or wing, stand at 34 floors followed by the north wing at 38 floors and the east wing at 36 floors. Unlike many traditional skyscrapers with zero-setback retail/lobby space on the ground floor, access to the tower is through an underground restaurant/retail concourse set a comparatively large distance away from the bordering streets.\n\nThe building was designed by the prominent Los Angeles architectural firm Welton Becket and Associates (now Ellerbe Becket), with local associate architects Guirey, Srnka, Arnold & Sprinkle. Upon completion, the tower marked the beginning of a renewed investment in downtown Phoenix that would last for almost twenty years until the savings and loan crisis brought about the 1989 real estate crash. Located at 201 North Central Avenue, the tower was renovated in 2003 to accommodate 800 additional Bank One employees.\nIn March 2007, Chase Tower was sold for record $166.9 million, the highest price paid for an office building in Phoenix.\n\nThe building was featured in the History Channel series \"Life After People\"."}}