{"Plano": {"Plano Senior High School": "Plano Senior High School (commonly Plano, Plano Senior High, or PSHS) is a public secondary school in Plano, Texas, serving students in grades 11–12. The school is part of the Plano Independent School District, with admission based primarily on the locations of students' homes. Plano is a two-time Blue Ribbon School and a Texas Exemplary School.\nFounded in 1891 as Plano Public School, serving both primary and secondary students, the school was, by the mid-1910s, sending a majority of its graduating students on to college. Plano High School, created in 1952 by separating the primary students into Mendenhall Elementary School, was immediately accredited by the Southern Association of Colleges and Schools, allowing its graduates to enter college without taking an entrance exam. In 1964, Plano High School integrated with the Frederick Douglass School (formerly Plano Colored School), and the integrated football team won the first of the school's seven state championships in 1965. In 1975, the school moved to a new 96-acre (39 ha) campus with five buildings, very similar to the layout of a junior college, where it has remained since. The old building is now the T. H. Williams High School, serving 9th and 10th grade. During the first year only at the new campus, PSHS served 10th - 12th grade, making the Class of 1978 the only class to attend school at this campus for three years.\nPlano administers more Advanced Placement tests each year than any other school west of the Mississippi River and all but one school in the United States. The school is accredited by the Texas Education Agency as well as the Southern Association of Colleges and Schools. Plano was ranked in the top 2,000 high schools in the United States in 2013. Plano's mascot is the Wildcat. In 2013 Plano was ranked 117th in Newsweek's review of America's Best High Schools.\nAs of the 2012-2013 school year, the school had an enrollment of 2,627 students and 149.54 classroom teachers (on an FTE basis), for a student-teacher ratio of 17.57:1."}}