{"Plano": {"Oak Point Park and Nature Preserve": "Oak Point Park and Nature Preserve is an 800-acre park in Plano, TX and is the largest park in the city. The park is bordered by Chapparal Road to the North, Los Rios Boulevard to the East, Parker Road to the South, and Spring Creek Parkway to the West. Oak Point Park and Preserve has 3.5 miles of concrete trails and 5 miles of soft trails, many of which are located along Rowlett Creek. In the southeastern region of the park, there is an equestarian area where vistiors can ride horses. There are 26 trails altogether. The North Trail connects to the Six Cities Trail in Allen, which connects to the Bluebonnet Trail.  Timber Chase Trail is a 0.88-mile trail which borders the main lake in the center of the park. Wildlife includes bobcats, coyotes, snakes, rabbits, turtles, and fish. Visitors can take the paved multi-use trail to the neighboring Bob Woodruff Park to see the oldest tree in Plano, a 200-year-old Bur Oak.  The lake is open to kayaking, canoeing, and stand-up paddle boarding from sunrise to sunset. Visitors aren't allowed to paddle at the lake before sunrise or after sunset because it will disturb woodland creatures. Inflatable watercraft and watercraft less than seven feet without two separate buoyancy chambers are prohibited.  The Amphitheater at Oak Point Park is an outdoor amphitheater that allows visitors to watch shows while enjoying the nature. The venue can hold up to 2500 guests and is the starting point for 5K walks in the park.  Located right off Los Rios Boulevard, the Oak Point Park and Nature Retreat Center is a 7,000 square-foot gathering place for many auspicious events and outdoor education.  The yearly Plano Balloon Festival is held at Oak Point Park and includes many fun activities such as hot air balloons, fireworks, and skydiving. There are also many running/walking activities: 1K, 5K, Half-Marathon, and Relay Race.  Go Ape is a 2-3 hour unique outdoor experience through the forest with many fascinating activities such as zip lines, Tarzan swings, and suspended obstacles like rail tracks."}}