{"Pomona": {"Puddingstone Reservoir": "Puddingstone Reservoir is a 250-acre (1 km²) artificial lake northeast of the interchange between the Orange Freeway (State Route 57) and the San Bernardino Freeway (Interstate 10) in Los Angeles County, California, United States. Activities include fishing, swimming, sailing, wind surfing, and camping.\nBrackett Field, Raging Waters, and Fairplex (formerly the Los Angeles County Fairgrounds) are all adjacent to Puddingstone Reservoir, which is inside Bonelli Regional Park.\nIn 1923, the County of Los Angeles Flood Control District purchased a large piece of land to construct a dam to hold back floodwaters from an area covering 30.3 square miles (78 km2). Work on the Puddingstone Dam started in February, 1925 and was completed in January, 1928. In 1932, a road across the top of the dam was constructed, creating a more direct route between the Pacific Electric station in San Dimas and Pomona Blvd. in Pomona. It was a considerably more direct route south - travelers previously had to either go west through Covina or east through Ganesha Park in Pomona.\nHistorically, Puddingstone Reservoir, besides acting as a flood control basin, also provided water to the local citrus growers. Water was pumped to a smaller reservoir further north, which was used for irrigation purposes. It was soon used for recreation as well, with fishing, boating, and swimming allowed along selected beach areas. Los Angeles County established Frank G. Bonelli Regional Park at the site. A swimming pool facility was constructed by the County in the area just north of the reservoir, but in the late 1970s or early 1980s, they leased the area to a private developer who constructed Raging Waters, a pioneering water-themed amusement park.\nToday, the road over the dam is still in use and is undergoing major upgrades. Following the construction of Raging Waters, the road was renamed Raging Waters Drive, and extends from the entrance to the park on the south, to Puddingstone Drive on the north. The original portion of the road's right of way to Pomona was developed as part of the Orange Freeway (State Route 57)."}}