{"Pomona": {"Pomona College": "Pomona College is a private, nonsectarian, coeducational, liberal arts college in Claremont, California, United States. It was founded in 1887 by a group of Congregationalists who wanted to recreate a \"college of the New England type\" on the West Coast. In the 1920s, it became the founding member of the Claremont Colleges consortium as President James A. Blaisdell founded a consortium system modeled after those of Oxford University and Cambridge University.\nPomona is a four-year undergraduate institution, and enrolled approximately 1,700 students representing all 50 states and 63 countries in Fall 2017. The college maintains 48 majors and 600 courses, though students have access to nearly 2000 additional courses at the other Claremont Colleges. The college's 140-acre (57 ha) main campus is in a residential community near the foothills of the San Gabriel Mountains. Situated within the Greater Los Angeles metropolitan area, Pomona encourages students to take advantage of the region's cultural and academic offerings by funding off-campus excursions and internships. Pomona welcomed a new President for the campus, G. Gabrielle Starr, in October of 2017.\nPomona College is ranked first among all liberal arts colleges (and tenth among all undergraduate colleges) in the United States by Forbes and sixth among all liberal arts colleges by U.S. News & World Report. It had an 8.4% acceptance rate for the Class of 2021 admissions cycle and an endowment of $2.17 billion as of June 2017, ranking it among four-year colleges with the lowest admissions rate and giving it the sixth-highest endowment per student of any college or university in the United States. Seventy-four percent of enrolled students hail from out of state, 56% receive need-based financial aid, and 59% self-identify as domestic students of color or international students. Though it has a small student body, the college has produced 12 Rhodes Scholars, 14 Marshall Scholarship winners, numerous Watson Fellowship winners, and has been identified as a \"top producer\" of Fulbright Scholars."}}