{"Pomona": {"Western University of Health Sciences": "Western University of Health Sciences (WesternU) is a private, non-profit, graduate school for the health professions, with a main campus located on 22 acres (8.9 ha) in downtown Pomona, California, and an additional medical school campus on 50 acres in Lebanon, Oregon. WesternU offers degrees in osteopathic medicine, dental medicine, optometry, podiatric medicine, nursing, physician assistant studies, physical therapy, pharmacy, biomedical sciences, and veterinary medicine. With an enrollment of 3,839 students (2016–17), WesternU is one of the largest graduate schools for the health professions in California, offering 21 academic programs in nine colleges. The university also operates two patient care centers, and has a pet wellness center on its Pomona campus. The WesternU Pomona campus is also home to the Center for Oral Health (a non-profit organization focusing on promoting oral health), the Southern California Museum of Medical History, and the Harris Family Center for Disability and Health Policy.\nFounded in 1977, the first program at WesternU was its medical school, the College of Osteopathic Medicine of the Pacific (COMP). Since that time, several additional programs have opened. When the College of Veterinary Medicine opened in 2003, it was the first veterinary school to open in the United States in 20 years. In 2007, WesternU became the first university in the nation to appoint a female as dean of a veterinary medical school. In 2009, three new colleges opened: dental medicine, optometry, and podiatric medicine. In 2011, the university opened an additional campus in Lebanon, Oregon known as the College of Osteopathic Medicine of the Pacific - Northwest (COMP-Northwest). In 2015, the university's founding president, Dr. Philip Pumerantz, retired. He was the longest serving founding president of any university in the United States, and the longest serving current university president in the country.\nAll of the programs at WesternU have professional accreditation, and the university is accredited by the Western Association of Schools and Colleges. The medical school (COMP) is also accredited by the American Osteopathic Association's Commission on Osteopathic College Accreditation."}}