{"Pomona": {"Graber Olive House": "The Graber Olive House in Ontario, California, is the oldest operating olive packer in the United States.\nIn 1894, two years after planting olive trees in Ontario, CC Graber began selling vat cured olives. The house is a historical site.\n\nThe Graber Olive House has been an Ontario institution since 1894, two years after Clifford C. Graber and his brother, Charles, arrived from Clay City, Ind. Then only 19, Clifford Graber began growing citrus on his newly acquired acreage.\nDelighting in the taste of the locally grown olives cured by neighboring ranchers, he started curing his own. They proved so popular that he soon launched a small- scale business. In the beginning, his wife, Georgia Belle Noe, whom he married in 1905, sold fresh olives right out of the vats used to hold the olives after they'd been picked.\nBy 1910, Graber had developed his own rope-propelled contraption for grading the olives by size. He also began canning them. A decade later, seeking to expand his operations, he planted his trademark Manzanilla olive tree's in Hemet.\nIn 1934, Graber enlarged his cannery on the Ontario site. Nine years later, sons Robert and William took over the business, although Cliff remained active until his death in1955 at age 83. By 1963 Robert (Bob) Graber, who was born in the wood-frame family house on the Graber Olive property in Ontario, had become sole proprietor of the business.\nBob Graber and his wife, Betty, continued to work in the family business along with their son Cliff, who lives in the family home.\nIn 1963, Bob Graber moved the growing operation to 75 acres of olive groves in the San Joaquin Valley near Porterville, where it remains.\nIt is from Porterville that the company's olives are trucked south to Ontario during the harvest season, which lasts about two months each fall.\n\n\"Our olives are unique because they are tree-ripened before they are picked,\" said Flo Duncan, personnel director for Graber Olive House.\nOnce at the Ontario site, the olives are graded by size, then cured in one of 550 concrete vats for three weeks. Water and salt solutions are changed daily. After they are removed from the vats, the olives are fed through a filling wheel, where employees scoop them by hand into aluminum cans running on a conveyer belt. \"We are not computerized here,\" said Duncan with a touch of pride.\n\nA \"Panama paddle packer\" machine creates a 200-degree steam bath as cans are sealed tight with aluminum lids. Giant pressure cookers called retorts then pressurize the cans and their contents for 62 minutes at 242 degrees. After the cans cool, a labeling machine applies their identifications and sizes from the smallest (12) to the largest (16).\nIn a little more than three weeks, Graber Olives progress from tree to can. In a good season, the business processes about 150 tons of olives, which they ship to markets and gourmet stores around the world, Duncan said.\nAlthough canning season lasts about two months (October and November) at most, Graber Olive House is open year round for tours of the plant. The residence itself is not part of the tour. Two gift shops on the premisses sell olives and related gift items.\n\n"}}