{"Pomona": {"L.A. County Fair": "The Los Angeles County Fair is an annual county fair. It was first held on October 17, 1922, and ran for five days through October 21, 1922, in a former beet field in Pomona, California. Highlights of the Fair's first year were harness racing, chariot races and an airplane wing-walking exhibition. The fair is one of the largest county fairs in the U.S. Fair attendance has topped one million people in every year but one since 1948, and is the 4th largest fair in the United States.\nSince its inception, the Fair has been the link between California’s agriculture industry and the public, providing a community gathering place where people learn about California’s heritage and enjoy traditional Fair food, activities and entertainment. In recent years the fair has moved away from such agricultural heritage by transitioning from livestock competitions for area growers and ranchers to hired petting zoos. In addition to the 13-acre (53,000 m2) Ray Cammack Shows carnival, the Fair has an operational farm, an outdoor miniature garden railroad, California’s Heritage Square historical exhibit and America’s Kids-Education Expo, where school children discover A Day Full of Learning Cleverly Disguised as Fun. The End of Summer Concert Series features 19 nights of first-run musical entertainment and freestyle motocross.\nThe Fair is operated by the Los Angeles County Fair Association, a not-for-profit 501(c)(5) corporation. The Fair is held each September on 543 acres (2.20 km2) of fairgrounds known as Fairplex (Los Angeles County Fair, hotel and exposition complex). The Fair generates a national economic impact of more than $250 million, roughly the equivalent of hosting a Super Bowl every year.\nFairplex also includes the Sheraton Fairplex Hotel & Conference Center, the Sheraton KOA/RV Park, Barretts Sales and Racing, a defunct 0.625 miles (1.006 km) horse racing track, the Millard Sheets Art Center, the Child Development Center at Fairplex, the Fairplex railway exhibit, Barretts Equine Ltd., a thoroughbred horse racing auction facility and the Wally Parks NHRA Motorsports Museum."}}