{"San_Diego": {"Wells Fargo Plaza (San Diego)": "Wells Fargo & Company is an American international banking and financial services holding company headquartered in San Francisco, California, with \"hubquarters\" throughout the country. It is the world's second-largest bank by market capitalization and the third largest bank in the U.S. by assets. In July 2015, Wells Fargo became the world's largest bank by market capitalization, edging past ICBC, before slipping behind JPMorgan Chase in September 2016, in the wake of a scandal involving the creation of over 2 million fake bank accounts by Wells Fargo employees. Wells Fargo surpassed Citigroup Inc. to become the third-largest U.S. bank by assets at the end of 2015. Wells Fargo is the second-largest bank in deposits, home mortgage servicing, and debit cards. The firm's primary U.S. operating subsidiary is national bank Wells Fargo Bank, N.A., which designates its main office as Sioux Falls, South Dakota. Wells Fargo in its present form is a result of a merger between San Francisco–based Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998 and the subsequent 2008 acquisition of Charlotte-based Wachovia. Following the mergers, the company transferred its headquarters to Wells Fargo's headquarters in San Francisco and merged its operating subsidiary with Wells Fargo's operating subsidiary in Sioux Falls. Along with JPMorgan Chase, Bank of America, and Citigroup, Wells Fargo is one of the \"Big Four Banks\" of the United States. As of December 31, 2015, it had 8,700 retail branches and 13,000 automated teller machines. The company operates across 35 countries and has over 70 million customers globally.\nIn February 2014, Wells Fargo was named the world's most valuable bank brand for the second consecutive year in The Banker and Brand Finance study of the top 500 banking brands. In 2016, Wells Fargo ranked 7th on the Forbes Magazine Global 2000 list of largest public companies in the world and ranked 27th on the Fortune 500 list of the largest companies in the United States. In 2015, the company was ranked the 22nd most admired company in the world, and the 7th most respected company in the world. As of October 2015, the company had a credit rating of AA−. However, for a brief period in 2007, the company was the only AAA-rated bank, reflecting the highest credit rating from two firms. On February 2, 2018, the U.S. Federal Reserve Bank barred Wells Fargo from growing its asset base any further, based upon years of misconduct, until Wells Fargo fixes its internal problems to the satisfaction of the Federal Reserve."}}