{"San_Antonio": {"Acequia Madre de Valero (San Antonio)": "The Alamo Mission in San Antonio is commonly called The Alamo and was originally known as Misión San Antonio de Valero. It was founded in the 18th century as a Roman Catholic mission and fortress compound, and today is part of the San Antonio Missions World Heritage Site in San Antonio, Texas, United States. It was the site of the Battle of the Alamo in 1836, and is now a museum in the Alamo Plaza Historic District.\nThe compound was one of the early Spanish missions in Texas, built for the education of area American Indians after their conversion to Christianity. The mission was secularized in 1793 and then abandoned. Ten years later, it became a fortress housing the Second Flying Company of San Carlos de Parras military unit, who likely gave the mission the name Alamo. During the Texas Revolution, Mexican General Martin Perfecto de Cos surrendered the fort to the Texian Army in December 1835, following the Siege of Béxar. A relatively small number of Texian soldiers then occupied the compound for several months. They were wiped out at the Battle of the Alamo on March 6, 1836. When the Mexican army retreated from Texas several months later, they tore down many of the Alamo walls and burned some of the buildings.\nFor the next five years, the Alamo was periodically used to garrison soldiers, both Texian and Mexican, but was ultimately abandoned. In 1849, several years after Texas was annexed to the United States, the U.S. Army began renting the facility for use as a quartermaster's depot. The U.S. Army abandoned the mission in 1876 after nearby Fort Sam Houston was established. The Alamo chapel was sold to the state of Texas, which conducted occasional tours but made no effort to restore it. The remaining buildings were sold to a mercantile company which operated them as a wholesale grocery store.\nThe Daughters of the Republic of Texas (DRT) formed in 1895 and began trying to preserve the Alamo. Adina Emilia De Zavala and Clara Driscoll successfully convinced the state legislature in 1905 to purchase the remaining buildings and to name the DRT as the permanent custodian of the site. Over the next century, periodic attempts were made to transfer control of the Alamo from the DRT. In early 2015, Texas Land Commissioner George P. Bush officially removed control of the Alamo to the Texas General Land Office.\nThe Alamo and the four missions in the San Antonio Missions National Historical Park were designated UNESCO World Heritage sites on July 5, 2015."}}