{"San_Diego": {"Jessop's Clock": "Jessop's Clock is a large outdoor pendulum clock located in San Diego, California, United States. It was commissioned in 1905 by one of the city's noted jewelers, Joseph Jessop.\nThe clock has been a San Diego icon for more than 100 years and is designated landmark #372 on the city's list of historic landmarks. After standing on the sidewalk in front of the Jessop and Sons jewelry store in Downtown San Diego for most of the 20th century, it was moved in 1984 to Horton Plaza, a multistory downtown shopping center, and remains there today.\nThe clock tells the local time in hours, minutes and seconds, as well as the day of the week and the month of the year. There are 21 dials in all, 12 of which tell the time in different locations around the world. It is 22 feet (6.7 m) high and extends an additional 12 feet (3.7 m) below street level to house the movement. It is wound automatically by an electric motor every eight hours.\nClaude D. Ledger, an employee of Jessop's jewelry store, was assigned to build the clock. After fifteen months' work, the clock was completed in 1907. It won a gold medal at that year's Sacramento State Fair. It is reported that on the day of Ledger's death, Jessop's clock stopped working for reasons unknown. It was restarted and continued keeping time on the streets of San Diego.\nIn April 2009 the clock stopped working. A few months later it was given a two-month refurbishing and cleaning, paid for by the Jessop family, which still owns the clock. Joseph Jessop's 98-year-old great-grandson, David Jessop Jr., officially restarted the 102-year-old clock on November 5, 2009.\nIn 2012 the owners of the Horton Plaza shopping center terminated the rental agreement with the Jessop family and gave the family 6 months to find a new site for the clock. Jessop family representative Jim Jessop asked the public to suggest a new location for it - a location which is open to public view and preferably indoors. The new location will need 12 feet of space beneath the floor or ground for the clock's hidden works. An agreement was reached to move it to the San Diego Zoo, but that idea was abandoned in 2013 because city permitting requirements for the historic clock made it impractical for the Zoo to accept it."}}