{"Stamford": {"Old Greenwich, Connecticut": "Old Greenwich is a neighborhood/section and census-designated place in Greenwich in Fairfield County, Connecticut, United States. As of the 2010 census it had a population of 6,611. It was founded in 1641. Old Greenwich has become extremely popular for home buyers and ranks at 6th place in a March 22, 2017 Bloomberg report, \"America's 100 Richest Places\".\nThe town of Greenwich is one political and taxing body, but consists of several distinct sections or neighborhoods, such as Banksville, Byram, Cos Cob, Glenville, Mianus, Old Greenwich, Riverside and Greenwich (sometimes referred to as central, or downtown, Greenwich). Of these neighborhoods, three (Cos Cob, Old Greenwich, and Riverside) have separate postal names and ZIP codes.\nOne of the founding settlers of Old Greenwich was Elizabeth Fones, niece and daughter-in-law of John Winthrop, founder and Governor of the Massachusetts Bay Colony. What is now called Greenwich Point was known for much of its early history as \"Elizabeth Neck\" in recognition of Elizabeth (Fones) Feake Hallet and their 1640 purchase of the Point and much of the area now known as Old Greenwich.\nThe Old Greenwich Railroad Station, originally called the \"Sound Beach Railroad Station\", built in 1894 and added to the National Register of Historic Places in 1989, serves commuters in the neighborhood. The town's largest beach is on a long, thin peninsula at the southwest end of the neighborhood. The town's local beach is called Tod's Point after a former resident. The beach is now public property, which belongs to the town of Greenwich. Residents can purchase a seasonal beach pass. Non-residents can purchase a one-day pass for $20 per vehicle. During \"off season\", Innis Arden, a local golf club, is a popular sledding destination for kids in Old Greenwich and neighboring Stamford.\nOld Greenwich was known as \"Sound Beach\" in the 19th century, and the main road through the small downtown business section is Sound Beach Avenue.\nOld Greenwich had an industrial presence back in the 1950s/60s when Electrolux had a vacuum manufacturing facility on Forest Avenue, opposite \"ECCman Center\" (now Greenwich Civic Center). The Civic Center also hosted a very fine swamp where local kids would pick cattails and search for frogs and turtles.\nThe town of Greenwich has one political body (RTM - Representative Town Meeting). It has several distinct sections each with its own mailing address and ZIP code, such as Byram, Cos Cob, Glenville, Mianus, and Riverside and Greenwich proper (downtown Greenwich). The original \"well to do\" population lived mainly in \"The Back Country\" (north of the Merritt Parkway) or in the exclusive Belle Haven area on the waterfront. The town was founded there in 1641. The home of one of the founders is being restored on Shore road by the Historical Society."}}