{"Stamford": {"Downtown Stamford": "Downtown Stamford is the central business district of the city of Stamford, Connecticut, United States. Also known as \"Stamford Downtown.\" It is an economically thriving area of the city, with major retail establishments, a shopping mall, a university campus, the headquarters of major corporations and fortune 500 companies, as well as other retail businesses, hotels, restaurants, offices, entertainment venues, and high-rise apartment buildings. In recent years, more housing has been constructed in the neighborhood and more is planned.\nWith transportation widely seen as one of the biggest challenges facing the Economy of Stamford, Downtown has become an important transportation hub, as well as a business hub for lower Fairfield County. For example, it is an area within walking distance of the Metro-North train station, which is one of the busiest on the New Haven Railroad Line.\nThe Downtown area has been the heart of Stamford, Connecticut since colonial times. Much of the history of Stamford took place there. Most of the southern and central portions of Downtown have been designated as historic districts, listed as the Downtown Stamford Historic District on the National Register of Historic Places.\nIn recent years, new development has consumed much of the Downtown area, with the additions of new high-rise buildings and office towers such as the new 34-story Trump Parc Stamford, parks such as the new Mill River Park development project, and housing such as the new 17-story Highgrove Condominium Residences. Other development projects include new student housing at the UCONN Stamford branch, residential housing, and the massive planned Ritz-Carlton Stamford development, which will include two 39-story hotel/condominium towers. The project is currently on hold due to the economic downturn in 2008. The city also plans to make improvements to the Atlantic Street underpass beneath the New Haven Line railroad tracks just east of the Stamford Transportation Center in order to alleviate a traffic bottleneck. The improvements are also meant to allow quicker evacuation of areas of the South End if disaster strikes. The project received a $245,000 earmark in the federal budget passed in December 2007."}}