{"Stamford": {"German School of Connecticut": "The German School of Connecticut is a private, non-profit Saturday school founded in 1978 with a student body of over 350. The school offers a dual-track curriculum for non-native beginners, and native or near-fluent speakers. A professional teaching staff, most of whom are native German speakers, provide three contact hours on each of thirty Saturdays during the traditional September - May school year. Classes are held on two campuses (Stamford and West Hartford), ranging from Pre-School through High School and Adult. Students learn, improve or maintain German language skills while celebrating German, Austrian and Swiss cultures.\nStudying German at the German School of Connecticut is rewarding: Toddlers and elementary school children enjoy hands-on modern teaching, along with singing, playing and being with their friends. Middle school and high school students enjoy special projects and cultural events. Adult students enjoy the camaraderie and friendship among like-motivated class participants. The school also embodies an international parent community: those from German speaking countries are joined by US and other international parents. All appreciate the services of the school, most participate in the many traditional holiday celebrations, and many take advantage of the transnational networking opportunities.\nThe German School of Connecticut receives support from the German government, as well as local businesses and donors. In 2009 the school became one of the 66 US partner schools with Germany. It is a member of the World Association of German Schools Abroad (Weltverband Deutsche Auslandsschulen) and also a founding member of the German Language School Conference.\nCT Act concerning High School Credit for Private World Language Courses\nAs of July 1, 2008, Connecticut students studying World languages in community schools such as the German School of Connecticut are eligible to receive high school foreign language credit for their studies. This is a real benefit to the students, who put in many hours of study to master speaking, writing, listening and reading skills, as well as cultural information.\nStudents Learn for Their Future\nMany students and graduates of German School of Connecticut realize the advantage of studying one of Europe’s leading languages: Some plan to study in a German speaking country of Europe, some plan to split their future studies between universities in the US and a German-speaking country. Others study to gain a professional advantage. Certain high school students have the opportunity to take a special German language exam (the \"Sprachdiplom\"  ), which fulfills the language requirements for direct entry at a German university. High School students can also prepare for the AATG  National German Exam, and the AP  German Language Exam, earning one or more US college credits.\nIn 1982, the German School of Connecticut was the first German language school in the United States to be selected by The Standing Conference of the Ministers of Education and Cultural Affairs in the Federal Republic of Germany (Kultusministerkonferenz), and the Central Agency for Schools Abroad (Zentralstelle für das Auslandsschulwesen)  to administer the official Sprachdiplom I examination, and in 1983 added the Sprachdiplom II examination. These annual exams test the equivalence of ten and twelve years of German language study, i.e. language proficiency on the B1/A2 and C1/B2 Common European Framework of Reference  level, respectively."}}