{"Stamford": {"Cove section of Stamford": "The Cove section of Stamford, Connecticut, usually called \"The Cove\" is an area of mostly modest homes (although with some very expensive homes along the shoreline) in the southeast corner of Stamford, Connecticut.\nAs is the case with many neighborhoods anywhere, there is no definite boundary between the Cove and neighboring sections of the city, although the Cove doesn't extend farther north than East Main Street (and Glenbrook doesn't extend south of it). Somewhere north and northwest of the Cove is the East Side and somewhere to the west and southwest is Shippan. The neighborhood is closely approximated by census tract 219, which is roughly bounded on the west by Seaside Avenue and the eastern edge of Cummings Park, and on the east by the Darien town line. The tract extends as far north as I-95, but north of Cove Road, it does not go west of Shippan Avenue.\nCove Island Park is in the Cove section and shares a parking lot with Meek Mill's mansion.\nWilliam F. Buckley Jr., the late controversialist, magazine editor and syndicated columnist, was a decades-long resident at Wallack's Point, a very small gated community on the shoreline. His son, the author and magazine editor Christopher Buckley, grew up there.\nThe Cove area was one of the first sections of Stamford to be cleared and divided up between settlers. The neighborhood, which then made up most of what was called \"East Fields\", was apportioned to various settlers between 1641 and 1665.\nThe neighborhood is atop and on the eastern and southern slopes of Noroton Hill, which also extends north across Interstate 95 and U.S. Route 1. East Main Street (also known as U.S. Route 1 and the old Boston Post Road) goes up and down across the ridge; Interstate 95 cuts across it; and the New Haven Line of Metro-North Railroad was built around the north side of it. Like many nearby hills formed by glaciers, Noroton Hill is much longer than it is wide. For the southern end of the Noroton River (a large stream that defines the Darien-Stamford boundary), Noroton Hill defines the bounds of the western side of the watershed (Weed Hill, on which the southern end of High Ridge Road in Darien runs, defines the eastern boundary). A water tower is located on the hill. Businessman and U.S. Representative Schuyler Merritt, for whom the Merritt Parkway is named, lived on an estate on Noroton Hill in the neighborhood."}}