{"Stamford": {"Cos Cob Power Station": "Cos Cob Power Station was a historic power station near the Metro North Railroad tracks, the Mianus River and Sound Shore Drive in the Cos Cob area of Greenwich, Connecticut.\n\nThe Spanish Revival style station building of 1907 was significant as part of the first mainline railroad electrification in the United States, using alternating current (AC) electrification. The New York City subway systems and a Hudson River railroad line used lower voltage direct current (DC) electrification, but for longer distances that would mean high transmission losses or frequent and closely spaced substations.\nA 1903 New York State law prohibited the use of steam locomotives in New York City. The New Haven line of the New York, New Haven and Hartford Railroad ran commuter trains into the city, and electrification all the way to New Haven would avoid massive congestion and delays to commuter trains if locomotives were changed at the New York City limits or at Stamford, CT.\nThe \"New Haven\" chose AC electrification as proposed by Baldwin-Westinghouse, with locomotives which could operate on the third-rail DC system within city limits, and the AC system on the main line.\nThe plant was built by Westinghouse in 1907 in Mission Style, and was located on Long Island Sound. The plant used coal-fired steam turbines, and the three-phase alternators supplied single-phase power at 11 kV 25 Hz directly to the catenary. They also supplied power to the New York Central's Port Morris generating station to compensate the NYC for power consumed by New Haven trains on the NYC's third-rail supplied line to the Grand Central Terminal within the city limits.\nThe station was designated a Historic Mechanical Engineering Landmark in 1982 by the American Society of Mechanical Engineers.\nThe power station was decommissioned in 1986-87.\nThe plant was listed on the National Register of Historic Places in 1990, but despite the listing and local and national debate, the plant was demolished in 2001."}}