{"Stamford": {"East Side of Stamford": "The East Side of Stamford, Connecticut is a neighborhood southeast of Downtown, north of Shippan, and northwest of The Cove and south of Glenbrook. It is mostly to the south of Interstate 95 but covers both sides of East Main Street (U.S. Route 1). Stamford’s East Main Street is part of U.S. Route 1. Before I-95 was built in the early 60′s, Route 1 was Connecticut’s most critical highway. Its physical location follows old 18th century mail routes and toll roads. It is still referred to in some communities as “the King’s Highway” or “the Boston Post Road.” Stamford’s growth can be traced by looking at the changes that have occurred along East Main Street. Little more than 100 years ago there was, by comparison to today, almost no development between Elm Street and the Noroton River. However, the East Side – bounded by Glenbrook Road and Hamilton Avenue to the North; Cove Rd to the South; Weed Ave to the East; and Grove and Elm Streets to the West – are easily identifiable on turn of the century maps.\nBecause of its traditional traffic and commercial functions, East Main Street developed as a spine from which several of the city’s neighborhoods spread to the north and south. It has therefore been thought of as a corridor, somewhat distinct from the neighborhoods just a few feet away. But it is more appropriate to think of it as an integral part of several neighborhoods, forming a link between the Downton, Glenbrook, Cove and Shippan areas. It is, in part, based on the historic position of the East Side and the natural growth from the city center into the surrounding areas, that this community has such potential.\nThe East Side of Stamford is home to large corporations, such as World Wrestling Entertainment, who has their headquarters on East Main Street approaching the Darien border, Chelsea Piers CT on 1 Blachley Road at the former Clairol campus, NBC Sports Network on Blachley Road, Hospital for Special Surgery - Stamford on Blachley Road and Deloitte at 695 East Main Street.\nWhen the Stamford city government revised its master plan for development in 1999-2002 the East Side was considered together with the Cove as one neighborhood. The East Side Partnership was founded in 2002 to support community development. The organization is composed of area residents, business owners and community advisors with a common goal of representing the interests of the East Side and to improve the quality of life for residents, business owners, property owners, professionals and visitors.\nFrom 2000 to 2005, population growth in the area a half mile around the intersection of East Main Street and Lockwood Avenue was almost 4 percent, nearly twice the growth rate of the rest of the city, according to a 2005 preliminary report by AMS Consulting of Bridgeport, a company working on a development plan for the area. The report found the neighborhood has strong potential for economic development, with high traffic counts and easy access to Interstate 95. The East Side of Stamford is one of the fastest growing communities in Stamford with 2 new, luxury apartments complexes and 3 large corporations joining the East Side since 2008. The neighborhood is rich in diversity with authentic restaurants and speciality shops serving the community."}}