{"Tulsa": {"Red Fork, Oklahoma": "Red Fork is a community in Southwest Tulsa. It was founded in 1883 as a railhead on the Arkansas River. It is famous for being the location of the first oil well in Tulsa County, the Sue A. Bland. On June 25, 1901, the first oil well in Tulsa County was completed by Drs. J.C.W. Bland and Fred S. Clinton in Red Fork. Dr. Bland, the first graduate physician in Tulsa, had moved to Red Fork in 1895 to set up a country practice. The well was on the homestead allotment of Dr. Bland’s wife, Sue A. Bland, a Creek citizen. The Sue Bland #1 was a thirty barrel well at a depth of 600 feet. This well brought the first nationwide publicity and oil boom to Tulsa and the Indian Territory.\nThe town is sometimes said to have been named for the Cimarron River, but both forks there are far upstream and both are reddish. The river through Tulsa is a not a fork but a merger of the Cimmaron, but it is the reddish fork of the Arkansas from where it joins the normally blue-green Verdigris River downstream. The contrast in color was striking to early explorers coming upstream.\nRed Fork originally was on what was to become Route 66, stretching back to Lookout Mountain and west towards Berryhill. After the oil discovery, it looked like Red Fork might outdo Tulsa, but Tulsa boosters succeeded in attracting new people and businesses there. Also, Red Fork was limited in size by the bend of the river and by the steep hills. Tulsa annexed Red Fork on October 16, 1927, and in 1928 the post office lost its separate status and became Red Fork Station (now West Tulsa Station) of the Tulsa Post Office.\nWhile mostly residential, Red Fork is home to television station KTUL (Channel 8), a unique railroad-themed restaurant, an award-winning bed and breakfast in a 120-year-old rock home, Route 66-related businesses, historic schools, a BNSF railroad yard, and a popular Tulsa Park recreation center. Nearby are two colleges, a major Tulsa regional library, and oil and transportation-related businesses (among others).\nRed Fork was once home to Crystal City amusement park featuring Tulsa's giant original Zingo roller coaster, among other rides, and a giant swimming pool. The privately owned park was built in 1929, but went out of business in the 1950s, after both the Casa Loma bath house and dance hall buildings burned down.\n\n"}}