{"Tulsa": {"Riverfield Country Day School": "Riverfield Country Day School (RCDS) is a private school based in Tulsa, Oklahoma, United States.\nRiverfield Country Day School was founded in 1984 by a group of parents and teachers working with Marty and Tom Clark. This group’s motivation was to provide an enhanced opportunity for educational growth and personal development for their children, with an emphasis on the whole child.\nThe school opened in August 1984 in a remodeled post office, with 40 children from three months old to second grade. The long-range plan included a country campus with outdoor learning. However, when enrollment more than doubled in five months, plans were accelerated to move \"to the country,\" across the Arkansas River in a field, thus the name Riverfield Country Day School.\nIn 1991, Riverfield relocated to the first wing on its current campus. The following year, an additional wing with a library and music room was added to serve the growing demand for elementary grades. The Middle School opened in August 1994, bringing the total facility to more than 40,500 square feet serving more than 400 students. Two donations of property from grandparent and former Board member Steve Jatras and a school-funded purchase brought the total acreage to 90.\nRiverfield began a new era in August 2002, with the addition of a freshman class. The school embarked on the \"Spreading Our Wings\" capital campaign in order to build facilities to accommodate the growing student body. The campaign was successful, thanks in large part to the generosity of Tulsa philanthropist Genave Rogers. On Visiting Day in November 2004, the Clark Gymnasium and Genave Rogers Upper School were dedicated with the help of Dr. Jane Goodall who joined us to dedicate the Science Lab in memory of Tim O’Halloran, the first Upper School Head.\nIn August 2006, Ms. Rogers made another very generous gift that made it possible to purchase an additional 30 acres to the northwest of the current property. This brought the campus to 120 total acres. The Langerak Academic Center was added in the spring of 2008, the Martha S. Clark Field was dedicated in the fall of 2010 and four tennis courts hosted their first matches in the spring of 2011.\nDuring the 2011-12 school year, administrators, faculty, Board members, students, parents, and alumni worked together on a Strategic Plan that will chart Riverfield’s course for 2012-17. Focus areas of the Strategic Plan are culture; programming; school community; faculty, administration, and staff; physical plant and facilities; and finance and development. A new Upper and Middle School building was recently completed (as of the 2013-14 school year), complete with a media center, a cafeteria, three science labs, and classrooms for foreign languages, English, math, and history.\n\nRCDS has what is regarded by many to be the best school music program in the country, Riverfield Rocks. RCDS also has a summer camp called \"Camp Raven\" spanning 12 weeks in the summer and operated under Summer Camp Director and High School science teacher Ric Breig.\nThe 120-acre campus also features a football field, four tennis courts, and numerous hiking trails."}}