{"Tulsa": {"The Church Studio": "The Church Studio is a recording studio housed in an old church in Tulsa, Oklahoma. During the 1970s it became closely associated with its owner, recording artist Leon Russell, and with the genre of music known as the Tulsa Sound.\nThe building was listed on the National Register of Historic Places on September 8, 2017 due to its significance to American music culture and being the heart of the Tulsa Sound. [1] [2]\nOriginally built in 1915 as Grace Methodist Episcopal Church, the stone structure located at 304 South Trenton Avenue in Tulsa's Pearl District was converted to a recording studio in 1972 by Leon Russell, who bought the building and adjoining properties for his diverse recording activities and as a home for Shelter Records, the company he had earlier started with partner Denny Cordell.\nNumerous musicians recorded at The Church, including Willie Nelson, Eric Clapton, Bonnie Raitt, Dwight Twilley, Dr. John, JJ Cale, The Gap Band, Freddie King, Phoebe Snow and Peter Tosh. Tom Petty, with his early band Mudcrutch, signed his first record deal with Shelter Records there.\nLeon Russell ultimately was inducted into the Rock & Roll Hall of Fame, Songwriters Hall of Fame, and Oklahoma Music Hall of Fame. In 2010, the Pearl District Association and the city of Tulsa collaborated to rename as \"Leon Russell Road\" the section of East Third Street where the church is located. After he died in 2016, flowers, paintings, memorabilia, and notes left by fans covered the church steps as a memorial.\nRussell eventually sold the building. Tulsa musician Steve Ripley, leader of The Tractors and partners bought it in 1987.[3] [ Ripley sold it in 2006. In 2009 new owners Jakob and Randy Miller declared their intention to revive it as a music facility. In 2016 the building was purchased by Tulsa entrepreneur Teresa Knox and her husband Ivan Acosta. <http://m.tulsaworld.com/blogs/scene/offbeat/with-new-owners-the-church-studio-aims-for-recognition/article_66d41471-9e36-5851-ba77-96edf3eed8eb.html?mode=jqm> They have said they intend to renovate the building (in a process that will take about two years), seek registration on the National Register of Historic Places, and use it as a recording studio and community facility."}}